{
  "schema": 
  {
    "category": "music|visual-arts|theater",
    "type": "performance|class|workshop|lecture|exhibition",
    "slug": "dashed-title--mmm-dd-yyyy",
    "title": "",
    "performer": "",
    "description": "",
    "details": "",
    "note": "",
    "series": "",
    "price": "",
    "time":{
      "start": "hh:mm",
      "end": "hh:mm"
    },
    "date":{
      "start": "yyyy-mm-dd",
      "end": "yyyy-mm-dd"
    },
    "image": "",
    "image_width": "",
    "image_height": "",
    "ticket": "",
    "stream": "",
    "youtube": "",
    "ics": "",
    "show_registration_form": false,
    "reference_slug": ""
  },
  "events":[
    {
      "category": "music",
      "type": "workshop",
      "slug": "mt-shasta-songwriters-circle--mar-25-2020",
      "title": "Mt. Shasta Songwriters Circle",
      "performer": "Merle Anderson",
      "description": "The Jefferson Center for the Arts hosts a workshop for songwriters. Writers are invited to present their own original songs in the singer-songwriter genre. Beginners, amateurs and professionals are encouraged to bring an instrument and debut a song or two. This is not a public performance event. Attendance limited to writers who will share original songs in a supportive circle of writers.\n\nFor information contact Merle at (530)-925-6795 or merleanderson808@gmail.com.",
      "details": "The Mt. Shasta Songwriters Circle at the Jefferson Center for the Arts is an opportunity for local singer songwriters, especially amateurs, to share their songs with other songwriters in an informal, supportive environment.\n\nThe format of the circle encourages participants to present one or two songs per evening, or an original song plus singing a cover of somebody else’s song or reading lyrics or a poem that inspires their songwriting passion. The writer may invite critique and discussion of their songs from other participants, but they can choose not to. Emphasis is on encouragement and sharing.\n\nWriters may also invite other participants to accompany their songs, such as playing backup or joining in on choruses, but this is not a jam session.\n\nMerle Anderson is the host and facilitator of the songwriters circle. One of the primary themes for the circle is, “If we don’t introduce and play our songs, who will?”\n\nWhile this is not a class about songwriting, there will be group discussion about related topics such as songwriting craft, inspiration, and favorite songwriters and songs.",
      "note": "",
      "series": "Mt. Shasta Songwriters Circle",
      "price": "",
      "time":{
        "start": "19:30",
        "end": "21:00"
      },
      "date":{
        "start": "2020-03-25",
        "end": "2020-03-25"
      },
      "image": "mt-shasta-songwriters-circle.jpg",
      "image_width": "575",
      "image_height": "350",
      "ticket": "",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "ics": "",
      "show_registration_form": false,
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "george-jackson-cameron-dewhitt--may-22-2020",
      "title": "George Jackson & Cameron DeWhitt",
      "performer": "George Jackson & Cameron DeWhitt",
      "description": "George Jackson & Cameron DeWhitt... a Nashville-based old-time, bluegrass fiddler joins one of the finest clawhammer banjo players alive.",
      "details": "[George Jackson](https://www.georgejacksonmusic.com/) is a Nashville-based old-time and bluegrass fiddler. Born in New Zealand, George grew up in a musical family and first heard bluegrass music around the age of 14, immediately falling in love with the style he started trying to work out how to play it from recordings and from the few mentors he could find in New Zealand. As a resident of Nashville and the USA from 2016, George released an album of original old-time style fiddle tunes, “Time and Place” in 2019 to acclaim. He was awarded the 2019 Mike Auldridge composition award by the DC bluegrass union for his tune “Chapel Hill Deer Stalk” and sparked a viral fiddle tune with his composition “Dorrigo”, with hundreds of musicians learning the tune and posting videos of themselves playing it online, becoming known as the “#dorrigochallenge”. Each track on “Time and Place” is written by George and named for its time and place of composition, tracing his journey from New Zealand to his new life in the United States, exploring ideas of authenticity and identity through fiddle music.\n\n[Cameron DeWhitt](https://www.camerondewhitt.com/) is a banjoist and Old Time musician living in Portland, Oregon. He hosts the weekly podcast Get Up in the Cool: Old Time Music with Cameron DeWhitt and Friends, which features conversations and musical collaborations with today’s most influential traditional musicians. As the host of Get Up in the Cool, Cameron has applied his idiosyncratic clawhammer banjo technique to many traditional musics, from old time Appalachian and bluegrass to Métis, Scandinavian, Acadian, Irish, and New Mexican, to name a few. As a performer, he curates a unique musical experience featuring his favorite findings (and creations) uncovered during his interminable bouts of curiosity. “Cameron DeWhitt, at the age of 28 [is] already among the finest clawhammer banjo players alive.” — R.D. Eno, Banjo Newsletter",
      "series": "",
      "price": "$15 at venue / $15 online →",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2020-05-22",
        "end": "2020-05-22"
      },
      "image": "george-jackson-cameron-dewhitt.jpg",
      "image_width": "800",
      "image_height": "474",
      "ticket": "98576895147",
      "stream": "",
      "youtube": "K2taK9Zp3W0",
      "youtube2": "4FVHq8DyVPc",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "kevin-patrick-radley--may-1-2020",
      "title": "Kevin Patrick Radley",
      "performer": "Kevin Patrick Radley",
      "description": "KPR is a singer songwriter from the San Francisco Bay. Radley draws his musical influences from the American musical landscape of blues, country, soul and the occasional country holler. His songs explore the time honored themes of love, loss and redemption, with touch of social commentary.",
      "details": "[Kevin Patrick Radley](https://www.facebook.com/KPRtheHollar) plays a number of instruments including guitar, harp and an occasional “unruly” cigar box guitar. Radley’s songs explore a variety of time honored themes of love, loss and redemption; all performed in the spirit of the juke joint jam. He has played at number of venues throughout northern California including * For Folk's Sake Music Festival in Vallejo, CA * The Lost Church, SF Bay Area Blues Festival in 2015 * Down Home Music in El Cerrito, CA * Armondo’s in Martinez CA * Silos’s in Napa Ca * Pops Cultural Center in Dunsmuir, CA as well as the 12 Bar Club in London, England. On his first CD, Kevin Patrick Radley includes a variety of musical guests. He is currently working on his second CD “City/Country” which is to be released in Spring 2020.\n\n“If it ain’t a damn it ain’t worth a holler”.",
      "series": "",
      "price": "$15 at venue / $12 online →",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2020-05-01",
        "end": "2020-05-01"
      },
      "image": "kevin-patrick-radley.jpg",
      "image_width": "800",
      "image_height": "480",
      "ticket": "98574706601",
      "stream": "<iframe width='300' height='450' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/519399408&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>",
      "youtube": "",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "dusty-green-bones-band--apr-26-2020",
      "title": "Dusty Green Bones Band",
      "performer": "Dusty Green Bones Band",
      "description": "This band of misfits from San Francisco embody a playful approach to music which is all about having fun. They light up the dance floor with an electrifying blend of psychedelic jam-grass, bouncy Americana and uplifting rock.",
      "details": "Formed in January 2014, [Dusty Green Bones Band](https://dustygreenbonesband.com/) is a five piece electric newgrass group based out of California's Bay Area. Looking to form a “jamgrass” style band, this rowdy bunch of musicians met in the heart of San Francisco. The group consists of: Toby Sanchez-Mahan (acoustic guitar, vocals), Isaac Cantor (banjo), Scotty Brown (electric bass, upright bass, vocals), Forrest Allen (Mandolin), and Jon Ryan (drums). By taking musical styles from a wide variety of genres and mixing them with the high energy of hard-driving bluegrass, they have created a purely organic sound. Their music aims to expand the authentic complexity of traditional bluegrass by layering ancient tones with improvisation and rock n' roll. These ambitious musicians live to ramble across the country playing hand-crafted shows while creating an undeniably magical experience for their fans. Their music is progressive with an indisputable raw aesthetic as the band dares to push the musical envelope, tenaciously defining their own individual style. DGBB continues to build a following by maintaining a consistent tour schedule. Come enjoy a nightcap and boogie down with the Dusty Green Bones Band at any one of their upcoming shows.",
      "series": "",
      "price": "$15 at venue / $10 online →",
      "time":{
        "start": "18:00",
        "end": "21:00"
      },
      "date":{
        "start": "2020-04-26",
        "end": "2020-04-26"
      },
      "image": "dusty-green-bones-band.jpg",
      "image_width": "800",
      "image_height": "545",
      "ticket": "95947209687",
      "stream": "<iframe src='https://open.spotify.com/embed/album/4Zf9VQDS2WivyYPlYDEceu' allowtransparency='true' allow='encrypted-media' width='300' frameborder='0' height='380'></iframe>",
      "youtube": "xMoPV1sf0sg",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "ben-larsen--apr-18-2020",
      "title": "Ben Larsen",
      "performer": "Ben Larsen",
      "description": "The JCA is proud to host [Ben Larsen](http://benlarsenmusic.com/) on his solo tour!\n\nBen Larsen plays song centered folky psychedelic americana chamber pop.",
      "details": "Ben Larsen is a long time resident of Portland, OR where he began his music career thirteen years ago. A singer-songwriter, and multi instrumentalist, Larsen has been busy developing and producing his solo project and the Ben Larsen Band.\nHis new, self produced album Turn, was developed with the support of many mainstays of the Portland music scene. With roots in acoustic music, Turn grew into a multi genre project creating both an honest and humbling space for Larsen to expand his musical palette.\nSounds on the project range from a full string quartet and horn section, to Larsen alone in front of one mic with a guitar.\nAlways on the search for a deeper and more genuine understanding and connection to music and listeners, Larsen is constantly expanding and examining his role as an musician, artist and creator.",
      "series": "JCA Unplugged Concert Series",
      "price": "$15",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2020-04-18",
        "end": "2020-04-18"
      },
      "image": "ben-larsen2.jpg",
      "image_width": "600",
      "image_height": "400",
      "ticket": "",
      "stream": "<iframe style='border: 0; height: 42px;' src='https://bandcamp.com/EmbeddedPlayer/album=629965775/size=small/bgcol=333333/linkcol=e99708/transparent=true/' seamless><a href='http://benlarsen3.bandcamp.com/album/turn'>Turn by Ben Larsen</a></iframe>",
      "youtube": "g8P_YABhTTI",
      "ics": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "twisted-pine--mar-20-2020",
      "title": "Twisted Pine",
      "performer": "Twisted Pine",
      "description": "Praised by NPR for their “upbeat, poppy vibe; energetic, driving rhythms; and virtuosic solos,” Twisted Pine is sneak previewing their July 2020 release and a sound they call Americana funk. Steeped in traditional music, the players [Kathleen Parks on fiddle, Dan Bui on mandolin, Chris Sartori on bass, and Anh Phung on flute] are fearless, tuneful improvisers and passionate lovers of pop.",
      "details": "[Twisted Pine](https://www.twistedpineband.com/) has quickly become one of the most acclaimed young string bands in the Northeast. Audiences across the US and UK have been drawn to their forthright songwriting, lush harmonies, musical daring, and charismatic appeal.\n\nSteeped in traditional music, these musicians are also fearless, tuneful improvisers and passionate lovers of pop. Fiddler Kathleen Parks' command of the vocal mic is as charming as it is gutsy. On her instrument, Parks is an insatiable risk-taker, seeking out exciting new musical territories. Mandolinist Dan Bui is a master of melody and drive, celebrated widely for his dexterous, tasteful picking. And bassist Chris Sartori holds down the low end and a lot more, introducing creative, funk-inflected cadences that never overwhelm the beat.\n\nBut while it’s easy to celebrate each of the band members individually, Twisted Pine is more than a collection of talented musicians - it’s a unit that grooves together. Their intricate arrangements of swelling, syncopated rhythm and precise instrumental interplay bring the enveloping sound and hooks of indie pop to an acoustic instrumental setting.\n\nYou’ll find Twisted Pine on stages large and small, entertaining festivals of thousands and intimate rooms alike. Winners of the 2018 Boston Music Award's Americana Artist of the Year and selected as one of Improper Bostonian's 2018 “Top 10 Local Acts on the Rise”, Twisted Pine has played major events from Grey Fox to DelFest to Glasgow’s Celtic Connections and beyond. “They absolutely rule their musical world with humor and relish,” says legendary fiddler Darol Anger.\n\nTwisted Pine released its debut, self-titled album of original music in 2017, followed in 2018 by Dreams, an EP of “wildly innovative covers… full of spark, light, and irresistible force” according to PopMatters. Check out Twisted Pine on tour and see why the Boston Globe calls them “a wider version of stringband, boundary jumpers akin to outfits like Punch Brothers, Nickel Creek, and Crooked Still.”",
      "series": "",
      "price": "$15 at venue / $12 (kids $5) online →",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2020-03-20",
        "end": "2020-03-20"
      },
      "image": "twisted-pine.jpg",
      "image_width": "500",
      "image_height": "500",
      "ticket": "95688483831",
      "stream": "<iframe src='https://open.spotify.com/embed/album/2DtM05v3YHRxHdKf2WHsOi' width='300' height='380' frameborder='0' allowtransparency='true' allow='encrypted-media'></iframe>",
      "youtube": "o2QVN1Tt-3Y",
      "ics": "",
      "reference_slug": ""
    },
    {
      "slug": "patrick-galvin-plays-bach--apr-04-2020",
      "title": "Patrick Galvin plays Bach (evening show)",
      "description": "Violinist Patrick Galvin plays Bach. This evening show features the beautiful Bach violin concertos Patrick Galvin recently recorded on his last album. The evening concert will be 90-120 minutes long with an intermission.",
      "price": "$25 at venue / $20 online →",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2020-04-04",
        "end": "2020-04-04"
      },
      "reference_slug": "patrick-galvin-plays-bach-matinee--apr-05-2020"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "patrick-galvin-plays-bach-matinee--apr-05-2020",
      "title": "Patrick Galvin plays Bach (family matinee)",
      "performer": "Patrick Galvin",
      "description": "Violinist Patrick Galvin plays Bach. Family matinee. Children are encouraged to come experience a one hour immersion into the violin and its magic.",
      "details": "[Patrick Galvin](//patrickjmgalvin.com) was born in San Francisco, CA, and made his solo debut at age 11 with the Oakland East Bay Symphony. Patrick studied at the Peabody Conservatory in Baltimore; the Prayner Konservatorium in Vienna, Austria; and at the San Francisco Conservatory of Music. Patrick performs regularly throughout the United States and abroad, most often in solo appearances and with the pianist Jung-eun Kim.\nIt's a rare treat to have him in Mt Shasta!",
      "note": "All ticket proceeds go directly to the artist. Wine, beer, champagne, sparkling water & sodas available at the JCA concession bar.",
      "series": "",
      "price": "$12 adults, kids $5 (these special tix only available at the door beginning at 1:15 the day of the performance)",
      "time":{
        "start": "14:00",
        "end": "15:15"
      },
      "date":{
        "start": "2020-04-05",
        "end": "2020-04-05"
      },
      "image": "patrick-galvin.jpg",
      "image_width": "600",
      "image_height": "400",
      "ticket": "97390346147",
      "stream": "",
      "youtube": "hUOyQK3JfS0",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "special-consensus--feb-23-2020",
      "title": "The Special Consensus",
      "performer": "The Special Consensus",
      "description": "2019 Grammy Award Nominee The Special Consensus promises a fun-filled evening of exceptional bluegrass music. Bring the family! The Special Consensus has been thrilling their bluegrass loving audiences for decades.",
      "details": "[The Special Consensus](//www.specialc.com) is a bluegrass band that has achieved a contemporary sound in their four decades of performing, making their music a modern classic. Band leader and founder Greg Cahill is a recipient of the prestigious Distinguished Achievement Award from the International Bluegrass Music Association (IBMA) and Special Consensus has received five awards from the IBMA and two Grammy nominations.\n\nSpecial Consensus’ sound is grounded in a deep appreciation and understanding of bluegrass music; the infectious band sound reminds people of the past while utilizing the innovations of today. With the foundation of Greg’s unique banjo playing style, Rick Faris (guitar), Nate Burie (mandolin), and Dan Eubanks (bass) effortlessly support each other and consistently maintain their bluegrass center whether they’re playing a jazz-tinged instrumental or a song from their award-winning John Denver tribute album while consistently maintaining their bluegrass center. These four talented vocalists and instrumentalists follow their creative desires without straying too far from their roots.​\n\n‘Rivers and Roads’, the band’s 19th recording, was nominated for a 2019 Grammy, received five 2018 IBMA nominations, and was awarded Album of the Year. The tune “Squirrel Hunters” from that recording received the Instrumental Recorded Performance of the Year award.\n\nThe energetic Special C show features Rick’s high, emotional singing and inspirational guitar playing and Nate’s powerful voice and creative mandolin playing which provide the formidable counter to Greg’s driving banjo and Dan’s impressive bass playing that holds everything together and reflects his bluegrass, country and jazz performance experience. Their voices blend seamlessly.\n\nInternational tours have brought the band to Canada, Europe, South America, Ireland and the United Kingdom. The band has appeared on National Public Radio, The Nashville Network, the Grand Ole Opry at the historic Ryman Auditorium in Nashville, Tennessee, and in concert with symphony orchestras nationwide.\n\nDedicated to preserving their craft as well as keeping it fresh, in 1984 Special Consensus initiated the Traditional American Music (TAM) Program, to introduce bluegrass music to students in schools across the country and in several foreign lands.\n\nSpecial C’s continued success is a testament to their adaptability and contemporary appeal. The band records for Compass Records and proudly celebrates its 45th anniversary in 2020.",
      "series": "",
      "price": "$20 at venue / $15 online →",
      "time":{
        "start": "19:00",
        "end": "22:00"
      },
      "date":{
        "start": "2020-02-23",
        "end": "2020-02-23"
      },
      "image": "special-consensus.jpg",
      "image_width": "800",
      "image_height": "640",
      "ticket": "88975001625",
      "stream": "",
      "youtube": "UjV_C1Ycu9s",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "lorin-sklamberg--feb-21-2020",
      "title": "Lorin Sklamberg (Klezmatics) with Sasha Lurje and Craig Judelman",
      "performer": "Lorin Sklamberg, Sasha Lurje & Craig Judelman",
      "description": "Klezmatics’ lead singer and accordianist Lorin Sklamberg brings an unforgettable night of Yiddish music with Latvian singer Sasha Lurje and violinist Craig Judelman.",
      "details": "Featuring the voice of the Klezmer revival, co-founder of the Klezmatics, [Lorin Sklamberg](https://klezmatics.com/about/members/lorin-sklamberg/) (NYC) and established darling of the international Yiddish scene, Sasha Lurje (Latvia/DE), this new transatlantic collaboration presents an enchanting evening of Yiddish songs and dance music.\n\nFrom old folk ballads to rousing Yiddish theater and the golden age of the Lower East Side, these two pillars of the contemporary scene give an insiders tour of your favorite songs you've never heard. They're joined by fiddler Craig Judelman (USA/DE), whose deep background and natural familiarity with old time American music (Jewish and non) provides the perfect counterpoint, along with Mr. Sklamberg accordion, for these two voices. This small all star band packs a big punch, charming audiences with the stories of the Ashkenazic experience that range from intimate to revelatory.\n\nThis concert is much more than a collection of songs - the performers are also skilled storytellers, using the songs to give the audience a greater understanding of the culture and context that created them.",
      "series": "",
      "price": "$25 at venue / $20 online →",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2020-02-21",
        "end": "2020-02-21"
      },
      "image": "lorin-sklamberg-with-lurje-and-judelman.jpg",
      "image_width": "800",
      "image_height": "526",
      "ticket": "88973250387",
      "stream": "",
      "youtube": "SBby_P9nkYs",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "hattie-and-joe-craven--feb-16-2020",
      "title": "Hattie and Joe Craven",
      "performer": "Hattie and Joe Craven",
      "description": "This father & daughter duo has performed together all over the world to standing ovations. With crazy instruments and a great musical prowess.",
      "details": "Enjoy a performance of rearranged pop songs for the folk tradition spanning the last 100 years with stunning young vocalist Hattie Craven supported by her father, award winning multi-instrumentalist [Joe Craven](https://joecraven.com). Their father/daughter team has created a celebration of music making by finding common ground between different generations with differing musical tastes and sensibilities. This show curated by a father and his daughter, awakening each other to new possibilities as they each bring their influences to a multi-generational table.\n\nThey have presented to school and library programs, house concerts, clubs, theaters and nationally known music festivals.\n\nHattie, in addition to being a seasoned actor in community theater, has built a reputation as one of the finest young, if not youngest, performers on the stages of the Strawberry Music Festival, California Worldfest, Kate Wolf Memorial Festival, Live Oak Music Festival and the Millpond Music Festival – all to standing ovations.\n\nJoe is a creativity educator, former museum curator, camp director, poet/storyteller, fashion insultant, coast to coast music festival emcee (Millpond, Telluride Bluegrass & Delfest, to name a few) and recipient of the 2009 Folk Alliance Far-West Performer of the Year. He’s made music with many folks –from Grateful Dead guitarist Jerry Garcia, David Lindley & harmonica wizard Howard Levy, to 7 years with banjo fusionist Alison Brown and 17 years with the mandolinist David Grisman.\n\nHattie’s singing and sparkling presence to young hearted people of all ages on and off the stage, along with her father’s good humor and instrumental prowess on a variety of conventional and odd ball instruments make for a captivating and memorable show.",
      "series": "",
      "price": "$20 at venue / $15 online / kids 12 & under $5",
      "time":{
        "start": "18:00",
        "end": "21:00"
      },
      "date":{
        "start": "2020-02-16",
        "end": "2020-02-16"
      },
      "image": "hattie-and-joe-craven.jpg",
      "image_width": "640",
      "image_height": "588",
      "ticket": "88972624515",
      "stream": "",
      "youtube": "QwyjP-2Uinw",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "workshop",
      "slug": "songetry-workshop-w-joe-craven--feb-16-2020",
      "title": "“Songetry” songwriting workshop with Joe Craven",
      "performer": "Joe Craven",
      "description": "This fun and engaging workshop will give you tools to be the songwriter you always wanted to be. Ages teen & adult.\n“Songetry” connects something most of us have already done (writing a poem) to something different (writing a song). Poems can tell a story in an accessible form of metered rhythm.\nEVERYONE has the ability to write such stories and that is the grist for the mill of songwriting.\n\nLeave with a song... Your 1st or 50th!\n\nBuy a ticket for the workshop online and you’ll be able to add 2 tickets for the price of 1 for the evening concert!",
      "details": "[Joe Craven](//joecraven.com/) is a multi-instrumental, award-winning creativity educator, former museum curator, actor, music festival emcee, Director of RiverTunes and Vocáli Voice Camps, a Co-Director for the Wintergrass Youth Academy and a fashion insultant. Joe Craven’s love of performing music has put him in many musical genres and alongside many musicians, from Jerry Garcia, David Lindley, Howard Levy, to Jason Marsalis and banjoist Alison Brown. For 17 years, he was percussionist / violinist for mandolinist David Grisman.\nUnder his own label, Blender Logic Arts, he has recorded and performed his wide variety of roots music projects. Joe also enjoys a fine reputation for his unique emcee work at music festivals and other art events for 20 years.\nAs an educator, Joe’s unique outreach programs have inspired communities in Costa Rica, corporate heads in Contra Costa, a dozen different music camps, thousands of school kids from Stockton to Scotland and college students from Alaska to Alabama. From Morocco to Mendocino – and performing solo, or in one of his many projects – whether he’s in Carnegie Hall or busking on Cannery Row – Joe’s at home and loving every minute!",
      "series": "",
      "price": "$35",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2020-02-16",
        "end": "2020-02-16"
      },
      "image": "songetry-workshop-with-joe-craven.jpg",
      "image_width": "800",
      "image_height": "538",
      "ticket": "88917349185",
      "stream": "",
      "youtube": "TuqDmwLxFjw",
      "ics": "",
      "show_registration_form": true,
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "phoebe-hunt--feb-14-2020",
      "title": "Phoebe Hunt",
      "performer": "Phoebe Hunt",
      "description": "Award-winning fiddler and vocalist Phoebe Hunt mixes Appalachian-style fiddle with Texas twang, Indian ragas & gypsy jazz. Rare solo performance!",
      "details": "Within critically acclaimed 2017 release, Shanti’s Shadow, [Phoebe Hunt](https://phoebehuntmusic.com) intimately revealed her inner journey through meditation and musical exploration. Her upcoming release, ‘Neither One Of Us Is Wrong’ (out April 10, 2020), takes flight from this personal introspection and casts reflection on our society that Hunt deems the duality of the ‘outer world’.\n\n“I see music, and art in general, as an opportunity to interpret and transmute the experiences we collectively encounter as we journey through life on this planet at this time.”\n\n[Watch music videos on Phoebe’s website](https://phoebehuntmusic.com/media)",
      "series": "JCA Unplugged",
      "price": "$20 at venue / $15 online →",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2020-02-14",
        "end": "2020-02-14"
      },
      "image": "phoebe-hunt.jpg",
      "image_width": "359",
      "image_height": "346",
      "ticket": "88970702767",
      "stream": "<iframe width='100%' height='166' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/651673013&auto_play=true'></iframe>",
      "youtube": "4gnNsxRNQnc",
      "ics": "",
      "reference_slug": ""
    },
    {
      "slug": "christmas-is-canceled--dec-15-2019",
      "date":{
        "start": "2019-12-15",
        "end": "2019-12-15"
      },
      "time":{
        "start": "14:00",
        "end": "15:30"
      },
      "ticket": "80553799583",
      "reference_slug": "christmas-is-canceled--dec-13-2019"
    },
    {
      "slug": "christmas-is-canceled--dec-14-2019",
      "date":{
        "start": "2019-12-14",
        "end": "2019-12-14"
      },
      "ticket": "80553382335",
      "reference_slug": "christmas-is-canceled--dec-13-2019"
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "christmas-is-canceled--dec-13-2019",
      "title": "Christmas is Cancelled - the musical",
      "performer": "Mount Shasta Children’s Theatre",
      "description": "Christmas is Cancelled is an original musical written for the Mount Shasta Children’s Theatre by Kale and Cory Coppin.",
      "details": "This world premiere features talented young actors and singers from all over Siskiyou county. It’s a fun, silly, spirited, musical comedy that is sure to bring out the holiday spirit in everyone.\n\nChildren eight and under are free at all performances 😀",
      "series": "",
      "price": "$15",
      "time":{
        "start": "19:00",
        "end": "20:30"
      },
      "date":{
        "start": "2019-12-13",
        "end": "2019-12-13"
      },
      "image": "christmas-is-canceled.jpg",
      "image_width": "800",
      "image_height": "400",
      "ticket": "80553091465",
      "stream": "",
      "youtube": "",
      "ics": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "mad-halleluiah--dec-27-2019",
      "title": "Mad Halleluiah - Live in Shasta",
      "performer": "Mad Halleluiah",
      "description": "Doors open at 7:30 PM\n\n[Mad Hallelujah](//madhallelujah.com) is excited to return to Mount Shasta for a post-Christmas celebration at the JCA.",
      "details": "Mad Hallelujah delivers a righteous and raucous audience-inclusive live experience driven by their dynamic signature sound, which incorporates classic rock, americana-folk, psychedelic jam, funk, and bluegrass influences. Igniting dance floors and lifting up spirits, Mad Hallelujah sets are a playful invitation to get “down & dirty… high & holy.”\n\nMad Hallelujah’s active lineup fuses the diverse musical backgrounds of Makete Roesch on vox & guitar, Daniel Wander on vox & lead guitar, mandolin & trombone, Ari Melinger-Cohen on bass, and Forrest Kelly on drums & percussion.\n\nMad Hallelujah was originally formed in New Zealand in 2015 as a multi-national collective of troubadours called “Mad Hallelujah Tribe.” They have since embarked on multiple independent world tours, released four self-produced albums, and headlined festival main stages on 3 continents.\n\nIn 2019 the band established a home base in Northern California, solidified their current lineup, and completed their first major tour of the western States, growing their dedicated following along the way.",
      "series": "",
      "price": "$15 at venue / $12 online →",
      "time":{
        "start": "20:00",
        "end": "23:00"
      },
      "date":{
        "start": "2019-12-27",
        "end": "2019-12-27"
      },
      "image": "mad-hallelujah.jpg",
      "image_width": "800",
      "image_height": "533",
      "ticket": "83301154997",
      "stream": "<iframe style='border: 0; height: 42px;' src='https://bandcamp.com/EmbeddedPlayer/album=1297593779/size=small/bgcol=333333/linkcol=e99708/transparent=true/' seamless><a href='http://madhallelujah.bandcamp.com/album/over-the-moon'>Over the Moon by Mad Hallelujah</a></iframe>",
      "youtube": "xDY9lEzJnr0",
      "ics": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "ben-larsen-unplugged--jan-4-2020",
      "title": "Ben Larsen - Unplugged",
      "performer": "Ben Larsen",
      "description": "The JCA is proud to host [Ben Larsen](http://benlarsenmusic.com/) on his solo tour!\n\nBen Larsen plays song centered folky psychedelic americana chamber pop.",
      "details": "Ben Larsen is a long time resident of Portland, OR where he began his music career thirteen years ago. A singer-songwriter, and multi instrumentalist, Larsen has been busy developing and producing his solo project and the Ben Larsen Band.\nHis new, self produced album Turn, was developed with the support of many mainstays of the Portland music scene. With roots in acoustic music, Turn grew into a multi genre project creating both an honest and humbling space for Larsen to expand his musical palette.\nSounds on the project range from a full string quartet and horn section, to Larsen alone in front of one mic with a guitar.\nAlways on the search for a deeper and more genuine understanding and connection to music and listeners, Larsen is constantly expanding and examining his role as an musician, artist and creator.",
      "series": "JCA Unplugged Concert Series",
      "price": "$15",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2020-01-04",
        "end": "2020-01-04"
      },
      "image": "ben-larsen2.jpg",
      "image_width": "600",
      "image_height": "400",
      "ticket": "80332012211",
      "stream": "<iframe style='border: 0; height: 42px;' src='https://bandcamp.com/EmbeddedPlayer/album=629965775/size=small/bgcol=333333/linkcol=e99708/transparent=true/' seamless><a href='http://benlarsen3.bandcamp.com/album/turn'>Turn by Ben Larsen</a></iframe>",
      "youtube": "g8P_YABhTTI",
      "ics": ""
    },
    {
      "category": "",
      "type": "benefit",
      "slug": "mt-shasta-oktoberfest-oct-19-2019",
      "title": "Mount Shasta Oktoberfest",
      "performer": "",
      "description": "A benefit for Jefferson Center for the Arts.\n* German Beer\n* Traditional Food\n* Dancing\n* Kids Activities\n* Raffle, Games & Live Music\n* Craft Vendors & More!",
      "price": "$10, or $25 with Souvenir Mug and Beers. (Das Kiddos are Free)",
      "time":{
        "start": "12:00",
        "end": "18:00"
      },
      "date":{
        "start": "2019-10-19",
        "end": "2019-10-19"
      },
      "image": "oktoberfest2019-w450.jpg",
      "ics": ""
    },
    {
      "category": "",
      "type": "gala",
      "slug": "grand-opening-gala-oct-13-2019",
      "title": "GRAND OPENING GALA!",
      "performer": "",
      "description": "Come celebrate Jefferson Center for the Arts' Grand Opening of the JCA Studio Theatre!\n\nSpecial Musical Guests: [Beaucoup Chapeaux](http://www.beaucoupchapeaux.net).\n\n![Beaucoup Chapeaux](beaucoup-chapeaux.jpg)\n\nChampagne & Hors D’oeuvres at 6:30pm.\nConcert begins at 7pm.\nDesserts to follow.",
      "price": "$35 adv, $40 at the door",
      "time":{
        "start": "18:30",
        "end": ""
      },
      "date":{
        "start": "2019-10-13",
        "end": "2019-10-13"
      },
      "image": "grand-opening-gala-w450.png",
      "ticket": "158781",
      "ics": ""
    }
  ]
}