{
  "schema":
  {
    "category": "music|visual-arts|theater|fest|festival|summit|comedy",
    "type": "performance|class|workshop|lecture|exhibition|benefit|gathering",
    "slug": "dashed-title--mmm-dd-2023",
    "title": "",
    "performer": "",
    "description": "",
    "details": "",
    "note": "",
    "series": "",
    "price": "$25 at venue / $20 adv online →",
    "price_note": "---Online ticket purchase link to be added soon---",
    "ticket": "",
    "humanitix": "",
    "time":{
      "start": "hh:mm",
      "end": ""
    },
    "date":{
      "start": "2023-mm-dd",
      "end": "2023-mm-dd"
    },
    "location": "",
    "image": "",
    "image_width": "800",
    "image_height": "",
    "stream": "",
    "youtube": "",
    "youtube2": "",
    "youtube3": "",
    "flag": {
      "show_registration_form": false,
      "is_outdoors": false,
      "is_postponed": false,
      "is_canceled": false,
      "is_excluded": false,
      "is_free": false
    },
    "stamp": "",
    "stamp_summary": "",
    "sponsor_text": "",
    "sponsor_image": "",
    "reference_slug": "",
    "all_access_pass": {
      "link": "",
      "expires": "",
      "text": "",
      "note": ""
    }
  },
  "events":[
    {
      "category": "music",
      "type": "performance",
      "slug": "test--mmm-dd-2023",
      "title": "TEST",
      "performer": "",
      "description": "TEST",
      "details": "TEST",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →\nKids 8 and under FREE →",
      "price_note": "---Online ticket purchase link to be added soon---",
      "ticket": "",
      "humanitix": "",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2023-01-26",
        "end": "2023-01-26"
      },
      "location": "",
      "image": "",
      "image_width": "",
      "image_height": "",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": true,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "twisted-pine--jun-18-2023",
      "title": "Twisted Pine",
      "performer": "",
      "description": "Praised by NPR for their “upbeat, poppy vibe; energetic, driving rhythms; and virtuosic solos,” Twisted Pine takes traditional music in exhilarating directions, exploring a sound they call Americana funk.",
      "details": "[Twisted Pine](https://www.twistedpineband.com/) released their sophomore full-length album Right Now in 2020 (Signature Sounds Recordings). Exploring a sound they call Americana funk, Twisted Pine takes traditional music in exhilarating directions. “We’re rooted in bluegrass,” writes bassist Chris Sartori, “continually inspired by explorers like Bela Fleck, Jerry Douglas, and Sierra Hull. Right Now takes this heritage into a new dimension. Our bluegrass is jazzy, our indie folk is poppy, our grooves are funky.” Twisted Pine (Kathleen Parks, fiddle; Dan Bui, mandolin; Chris Sartori, bass; Anh Phung, flute) grooves with fearless improvisation and intricate arrangements. “They were once bluegrass,” wrote The Boston Globe, “but ... this Boston band has become something else, a wider version of string band, boundary jumpers akin to outfits like Punch Brothers, Nickel Creek, and Crooked Still.”  The Boston Herald included Twisted Pine in a 2023 roundup of four great New England acts, saying Twisted Pine's latest release “is progressive bluegrass or maybe chamber folk, or prog rock, or jazz fusion or just pop with an experimental bent. Whatever the genre, give the group a bluegrass Grammy for good measure.”  Twisted Pine is writing toward the next release, playing new songs on the road.",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "twisted-pine",
      "time":{
        "start": "19:30",
        "end": "22:00"
      },
      "date":{
        "start": "2023-06-18",
        "end": "2023-06-18"
      },
      "location": "",
      "image": "twisted-pine.jpg",
      "image_width": "500",
      "image_height": "500",
      "stream": "",
      "youtube": "6hJBc2h70gA",
      "youtube2": "o2QVN1Tt-3Y",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "alice-di-micele-trio--jun-14-2023",
      "title": "Alice DiMicele Trio",
      "performer": "Alice DiMicele, Rob Kohler, Andy Casad",
      "description": "Alice Di Micele Trio features Rob Kohler on bass & Andy Casad on guitar. “Alice’s music has that great combination of earthiness and groove that keeps it funky from the inside out. She’s for real.” ~ Bonnie Raitt",
      "details": "[Alice DiMicele](https://www.alicedimicele.com/) is an Americana/ Folk Singer-Songwriter based in Southern Oregon. Her voice is rangy, sometimes soft and intimate, other times bold and brassy, evoking a distinct mood in every song she sings. Alice built a dedicated fan base as an independent musician with stirring live performances spanning a three-decade career. Her new album, Every Seed We Plant, is her sixteenth release, a snapshot of life in these times – gut-wrenching, hopeful, vulnerable, intense.\n\nAlice collaborated with producer Bret Levick, who co-produced, arranged, and co-wrote the first track on her new release, leading Alice’s music into new territory. Pop, jazz, and rock and roll undercurrents flow beneath folk bedrock on this record. Her long-time bassists, Rob Kohler and Damian Erskine, joined talented players Bret Levick, Gene Black, Skip Edwards, David Jacobs- Strain, Jenny Conlee-Drizos, Andy Thorn, Terence Higgins, Barry Phillips, Dean Angermeier, Bob Evoniuk, Mikey Stevens, Matthew Kriemelman, and Christo Pellani on this album. Alice recorded her vocals and guitar tracks at her Tiny Wonderland studio in Southern Oregon.\n\nThe title track, Every Seed We Plant, was inspired by Alice’s dear friend and elder of the Takelma Tribe, Agnes Pilgrim Baker. “It was written on the way to Grandma Aggie’s memorial. The song overtook me, flowed out of me like Grandma was there guiding me. I wrote it, played it once, then sang it that day for her family and friends.”\n\nThe singles, Long Dry Winter and Alone, explore the grief, loss, and depression that many people experience these days. “I hope the songs remind folks to reach out and just simply be a presence for someone.” The new album balances the deeper emotional waters it treads with uplifting, lighter love songs like Free, and the fun, sparkly track, Sunrise.\n\nIn 2017, while mixing her One With The Tide album, she bonded with Bret Levick over rock and roll idol\n\nTom Petty, whose untimely death that year inspired Bret and Alice to start the band Petty Thievery. This deep dive into Petty songs influencedAlice’s songwriting, “Getting inside another songwriter’s head by playing so many of his songs has really opened me up in a new way.”\n\nAs an accomplished songwriter, Alice draws on folk, jazz, blues, R & B, and rock & roll influences, landing her music consistently on AAA, Folk, Americana, and Community radio stations around the country and internationally, including syndicated shows. Her deep acoustic groove, unique vocal style, and heartfelt lyrics create an unmistakable sound that is all her own.\n\nShe is a delightful performer and has shared stages with Bonnie Raitt, Joan Baez, JJ Cale, David Grisman Quartet, Steve Winwood, Ferron, Peter Rowan, Richie Havens, Bob Weir, Mickey Hart, and so many others. Alice has also performed at many festivals, including Strawberry Music Festival, High Sierra Music Festival, Oregon Country Fair, Joshua Tree Music Festivals, Britt Festivals, and Kate Wolf Music Festival.\n\nOriginally from New Jersey, Alice grew up singing in school choirs, “I sang on the way to school, and back home. I just made stuff up.” On her eleventh birthday, Alice’s Grandmother gave her Stevie Wonder’s album, Songs In The Key Of Life, “I learned every word, every note, and every nuance of that album by listening to it over and over.” She picked up the guitar at age 17 and honed her skills playing in coffeehouses in upstate New York and New Jersey. In 1986, she found her home in Southern Oregon and released her first recording in 1988,Make A Change.\n\nSixteen albums later, Alice is focused and clear on her mission, “I love solid, moving rhythm, and I do a lot of improvising vocally. I feel completely at home on stage. My job as a musician is to communicate emotion and stir that place inside that feels connected to other souls.”",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "alice-di-micele-trio",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2023-06-14",
        "end": "2023-06-14"
      },
      "location": "",
      "image": "alice-dimicele.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "5Yo9o2lIpVE",
      "youtube2": "82Obo3DIkFw",
      "youtube3": "B1Z4OQ7pvZk",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "puppeteers-for-fears-cthulhu-the-musical--jul-21-2023",
      "title": "Puppeteers For Fears - Cthulhu The Musical",
      "performer": "Puppeteers for Fears",
      "description": "Puppeteers for Fears presents, Cthulhu: The Musical! A rock’n’roll retelling of the horror classic “The Call of Cthulhu,” performed entirely with puppets. Runtime: two hours+ with one intermission. Rated R for language and themes. Includes flashing lights. Featuring live music from The Elephant.",
      "details": "**Cthulhu The Musical** - written by Josh Gross, directed by Katy Curtis and Alyssa Mathews.\n\nDetective LaGrasse is searching for a murderer. Francine Thurston’s uncle vanished. The only clue to both mysteries is a bizarre statue worshiped by a nightmarish cult. And it’s leading both of them out to sea, toward a mysterious island from their nightmares—and toward insanity. But, you know, with singing puppets.\n\nPuppeteers for Fears, Oregon's premier rock'n'roll puppet troupe, presents an original show that, in a sensible universe, would be impossible: a feature-length musical comedy adaptation of one of the least musical or comedic stories ever: H.P. Lovecraft’s cosmic horror classic, The Call of Cthulhu—performed entirely with puppets, and a live band.\n\nSee noir detectives, dancing tentacles, anarchist pirates, broken-hearted academics, sassy monsters, and more, as they sing and dance their way to love, madness, and possibly the end of the world.\n\n“You haven’t truly experienced Lovecraft’s madness until you’ve experienced it in its truest form: As a puppet musical.” —The Portland Mercury\n\n“The most blasphemous ritual of singing and dancing since Chicago.” —SyFy Wire\n\n“I don't even like puppets. But that was some next-level puppet shit.” —Susan, audience member",
      "note": "",
      "series": "",
      "price": "General Admission $25 at venue / $20 adv online →\nStudents/Seniors $20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "puppeteers-for-fears-cthulhu-the-musical",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2023-07-21",
        "end": "2023-07-21"
      },
      "location": "",
      "image": "puppeteers-for-fears-cthulhu-the-musical.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "the-suitcase-junket--may-24-2023",
      "title": "The Suitcase Junket",
      "performer": "Matt Lorenz",
      "description": "“The Suitcase Junket is a master of musical imagination” ~ NPR World Cafe",
      "details": "Matt Lorenz's vision, manifest in [The Suitcase Junket](https://thesuitcasejunket.com/), developed in the tension between the grand and the solitary. Grand in its imagery, sound, and staging. Solitary in its thrift and self-reliance. What instruments he requires, Lorenz builds from scratch and salvage. What parts five players would perform, he performs alone. The spectacle of his one-man set bears constant comparison to legends of showmanship, brilliance, madness, and invention.\n\nWhile audiences are captivated by his solitary form and the show itself, Lorenz, who homesteads with rescue dogs and chickens in rural Western Massachusetts, is most serious about the songs. He has been building a catalog, writing a world into existence. Solitary on stage and on the road, his mind is crowded with characters, narratives, voices, imagery, sounds as wide and varied as mountain throat singers and roadhouse juke boxes, plus newsreels of the planet's destruction and salvage. With this 2020 release, The End is New, Lorenz’s grand vision for the song overrides the how of it.\n\nCheck him out! He is incredible! [theSuitcaseJunket.com](https://thesuitcasejunket.com/)",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "the-suitcase-junket",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2023-05-24",
        "end": "2023-05-24"
      },
      "location": "",
      "image": "thesuitcasejunket.jpg",
      "image_width": "750",
      "image_height": "468",
      "stream": "",
      "youtube": "3DhZWAATmTc",
      "youtube2": "9xa_ph8o2Zc",
      "youtube3": "4rdlch518b4",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "pato-banton-free-show--apr-19-2023",
      "title": "FREE Pato Banton reggae concert",
      "performer": "Pato Banton",
      "description": "Reggae Legend Pato Banton is back for another incredible show. But this time it's FREE! The JCA will definitely reach capacity. So, advanced free tickets are highly recommended.",
      "details": "[Pato Banton](https://officialpatobanton.com/) is a grammy nominated reggae legend that has recorded and toured the world with The English Beat, Steel Pulse, UB40 & STING! (just to name a few) . During the year 2000, while in the midst of a global trek with Peter Gabriel’s WOMAD organization, that combined huge festivals with music outreach programs to poor and underprivileged communities, Pato learned that two of his sons had been shot in a drive-by shooting! He immediately put his career on hold and turned his sorrow into the impetus for community & educational initiatives that would consume the next six years of his life.\n\nPato created an organization called “Musical Connections” and in partnership the Community Safety Team, provided tuition and counseling for “at risk” young people in 16 different communities across his city of Birmingham, UK. This project was so successful that Pato was approached by the West Midlands Police Department to tackle the ongoing problem of gun crime in some of the poorest neighborhoods. Within a few years this partnership greatly reduced gun crime across the entire city and Pato was given a Lifetime Achievement Award by the BBC and entered into the British Music Hall of Fame during the same year.\n\nIn 2006, after feeling that he had planted enough seeds of progress within his home community, Pato decided to relocate to Southern California and embark on the second phase of his musical journey, taking with him the years of experience in the field of Loving Service. Since then Pato has recorded many albums and collaborated with artists all over the world. His most recent albums Love Is The Greatest & The Words Of Rastafari were released on Bob Marley’s Tuff Gong Records International.\n\nPato Banton’s four-decade public presence has increasingly transcended music to convey a positive & uplifting message of global peace and love for humanity. Now based in Southern California, he continues to record and tour the world extensively with his band The Now Generation, while simultaneously serving as a Teacher, Minister, Counselor and Mentor to his Fans, Friends & Family worldwide!",
      "note": "",
      "series": "",
      "price": "FREE →",
      "price_note": "ADVANCED FREE TICKETS are highly recommended. We dont want to turn anyone away at the door!",
      "ticket": "",
      "humanitix": "pato-banton-free-concert",
      "time":{
        "start": "19:30",
        "end": "22:00"
      },
      "date":{
        "start": "2023-04-19",
        "end": "2023-04-19"
      },
      "location": "",
      "image": "pato-banton.jpg",
      "image_width": "800",
      "image_height": "533",
      "stream": "",
      "youtube": "2qG5PlhdCMU",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": true
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "david-arkenstone-and-friends--may-26-2023",
      "title": "An Evening with David Arkenstone & Friends",
      "performer": "David Arkenstone",
      "description": "Join 5-Time Grammy Nominee David Arkenstone and friends for a joyous candlelit genre-blending musical journey from first note to last. Presented by QDV productions.",
      "details": "This candlelit concert is a joyous genre blend of neo-classical piano, new age, Celtic, progressive rock, orchestral, world music, and Music Inspired by Middle Earth. With over 100 million Spotify streams, 5 Grammy® nominations, 60+ albums, numerous film scores, game score compositions such as World of Warcraft, and unforgettable themes for NBC such as The Kentucky Derby, US Women's Figure Skating, and Premier League soccer, David’s music holds something for everyone, taking concertgoers on a musical journey from first note to last.\n\nJoined on stage by virtuoso musicians on violin, flute, cello, and percussion, David has plenty of surprises in store. A musical storyteller, he is passionate about taking listeners on a journey, creating sonic tapestries that evoke every emotion. “I envision a place where I would like to go, or an adventure I would like to take, and let my imagination run free,” says David. “I’ve gotten countless messages from listeners who love to take these journeys with me. I’m sometimes surprised by how powerfully people respond to my music.” visit [davidarkenstone.com](https://davidarkenstone.com/)\n\nReceiving Grammy® nominations in 2021, 2019, 2004, 2000, and 1992, David’s compositions are often influenced by the beauty of nature, classical music, Celtic dance, medieval folklore, and the realm of J.R.R. Tolkien’s Middle Earth. An Evening with David Arkenstone & Friends will embrace the Pacific Northwest with passionate compositions, heartwarming stories, and an evening to be remembered for years to come.\n\nAttendees may opt for a VIP Experience that includes a post-show autograph meet & greet, preferred seating, lanyard with tour laminate, a signed photo, and a custom compilation CD.\n\nVisit [davidarkenstone.com](https://davidarkenstone.com/) and join the Arkenfans Community on Facebook. You can also follow David on Facebook, Instagram, and Twitter for behind-the-scenes looks and even more magical content.",
      "note": "",
      "series": "",
      "price": "General Admission $35 at venue / $30 adv online →\nStudents w/ID $25 at venue / $20 adv online →\nVIP $45 adv online →",
      "price_note": "",
      "ticket": "552282320287",
      "humanitix": "",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2023-05-26",
        "end": "2023-05-26"
      },
      "location": "",
      "image": "david-arkenstone.jpg",
      "image_width": "800",
      "image_height": "470",
      "stream": "",
      "youtube": "1f-cnPiaUcA",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "comedy",
      "type": "performance",
      "slug": "jca-comedy-night-with-sam-miller--apr-28-2023",
      "title": "JCA Comedy Night with Sam Miller",
      "performer": "Sam Miller, Freeway Farrell, Mike Sparks",
      "description": "Join us for some hilarious comics at JCA COMEDY NIGHT with headliner SAM MILLER, featuring FREEWAY FARRELL, with special guest MIKE SPARKS.",
      "details": "**Sam Miller** is a comedian from Olympia Washington. He is 6 foot 6, 360 pounds, has 2 kids, (one of them is on purpose) he's been married for 11 years, and has been clean and sober for 14 years. Sam likes to make jokes about what it's like to be a sober parent. He also likes to make jokes about what jails like in Yakima. His first album and special, Round Trip, was recently recorded and filmed under the tutelage of Grammy-winning producer Dan Schlissel, whose indie label, Stand Up! Records, Sam had recently signed a three-album deal with. Sam was the runner-up in the 2021 Seattle International Comedy Competition and won the Comedy on Trial Competition in 2017. He's also performed with the Addicts Comedy Tour and at NA and AA conventions all over the northwest. For 3 consecutive years he won awards in “The Best of Olympia” issue of the Weekly Volcano. 2016 Best Local Hero 2017 Best Local Celebrity 2018 Best Comic Relief He has opened for Nate Jackson and Laurie Kilmartin and is regularly performing at clubs and casinos around the country.\n\n**Freeway Farrell**  has always been in the entertainment business. He began his career thirty-five years ago in high school as a Disc Jockey at a roller rink. He then hosted his own weekend time slot as a DJ at a local radio station. This later led to traveling the country while working as an on-air personality for various radio stations, whilst he also maintained a regular spot in the local stand-up comedy scene. Over the years, Freeway has been a comedy producer. Frequently requested Emcee, voice over actor and a colorful character actor. These days he has retired from radio and producing shows. Since 2016 he is now an active full time stand-up comedian, comedy writer, emcee and promoter. Freeway does comedy promotion work as a side hustle through his company Farrell Boys Promotions, to help the comedy community. As a standup comedian, Freeway has a deep passion for performing. He has three different sets, each an hour long. All sets can be performed clean, PG-13 or blue.\nFreeway looks forward to performing for you.",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "jca-comedy-night-with-sam-miller",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2023-04-28",
        "end": "2023-04-28"
      },
      "location": "",
      "image": "jca-comedy-night-2023-04-28.jpg",
      "image_width": "800",
      "image_height": "368",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "festival",
      "type": "",
      "slug": "earth-day-festival--apr-22-2023",
      "title": "Earth Day Festival",
      "performer": "",
      "description": "Earth Day 2023, sponsored by the Mount Shasta Ecology Center.",
      "details": "",
      "note": "",
      "series": "",
      "price": "FREE admission",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "",
        "end": ""
      },
      "date":{
        "start": "2023-04-22",
        "end": "2023-04-22"
      },
      "location": "",
      "image": "earth-day-2023-04-22.jpg",
      "image_width": "600",
      "image_height": "777",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "jimbo-scott-yesterdays-biscuits--apr-21-2023",
      "title": "Jimbo Scott & Yesterday's Biscuits",
      "performer": "Jimbo Scott & Yesterday's Biscuits",
      "description": "EARTH DAY PRE-PARTY. A favorite of the SF Bay Areas Folk & Americana Scene Jimbo is “Honest Honey-Eyed Americana” ...a mix of Tennessee country with Oakland soul",
      "details": "**[Jimbo Scott](https://jimboscottmusic.com/about/)**\n\nHave you ever been walking down the street, and suddenly heard a voice that made you walk into a venue to see whose it was? That is Jimbo Scott’s voice – a bell, magnetic and the definition of a powerhouse. A favorite of the Bay Area’s folk and Americana scene, Jimbo Scott has been entertaining audiences far and wide for more than a decade, including 2 years as a member of the famed NorCal Jamgrass band, Poor Man’s Whiskey. His solo work evokes traditions of Tennessee country and bluegrass, Oakland soul in sepia toned California landscapes and life-scapes.\n\nDescribed by Tahoe Weekly as “Honest Honey-Eyed Americana”, Jimbo’s music casts reflections around the room, flashing from honest self-deprecation to cinematic retrospectives on our part in shaping our communities and accounting the consequences of our actions and inactions. His signature baritone voice has moved many an audience including The Kate Wolf Music Festival, Hardly Strictly Bluegrass, Salmonfest and the Fillmore.\n\nAt the end of 2022, Jimbo teamed up with an all-star lineup of musicians to form Jimbo Scott and Yesterday’s Biscuits. Featuring Kiel Williams (the Risky Biscuits) on Guitar and Pedal Steel, Andy Merrill (The Risky Biscuits) on bass and Rob Hooper (Carolyn Wonderland, Jimmy Dale Gilmore, Patrice Pike) on drums, Jimbo Scott and Yesterday’s Biscuits are a rising force in the NorCal Americana Scene, not to be missed and best to be consumed with reckless abandon.\n\nIf you like Jason Isbell, Zach Brown, Leftover Salmon or Paul Simon then you will like Jimbo Scott.\n\nALL AGES WELCOME!\n\nKIDS ARE FREE :)",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →\nKids 8 and under FREE →",
      "price_note": "",
      "ticket": "598010283857",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2023-04-21",
        "end": "2023-04-21"
      },
      "location": "",
      "image": "jimbo-scott-yesterdays-biscuits.jpg",
      "image_width": "800",
      "image_height": "451",
      "stream": "",
      "youtube": "B0rY_q-fHhs",
      "youtube2": "Az5GNdigrcw",
      "youtube3": "_N1f_swWq-k",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "anna-moss-and-the-nightshades--may-16-2023",
      "title": "Anna Moss and The Nightshades",
      "performer": "Anna Moss and The Nightshades",
      "description": "Anna Moss returns to the JCA after a sold out show last season. And she brings her band The Nightshades! Adv tix highly recommended for this.",
      "details": "[Anna Moss](https://www.annamossmusic.com/) has a voice that will stop you dead in your tracks. She commands attention and takes audiences on a spiritual journey when she sings. Moss’s vocal quality is so unique and deeply healing that crowds often beg for down tempo and Acapella songs. It is in these moments that you can fully absorb the smokey, gritty and dynamic nature of her singing. Growing up in Berryville Arkansas, (a town whose main industry is chicken farming) Anna flew the coop and made her career playing music in the US, Canada, Europe, Central and South America. She has made waves in the folk and festival scenes of North America as a front woman for the band Handmade Moments. After seeing most of the Western World she decided New Orleans would be her home. Moving to the New Orleans has influenced Anna’s arrangements and style. She began writing her debut album in a dark depression during 2020. All shows were cancelled and live musicians were practically erased from the economy. It was in these bleak times that Anna wrote profusely and honed in her bedroom pop style. She searched for months to find a band in New Orleans to fill out her sound. Eventually she found what she was looking for. Fernando Lima, a local percussionist and drummer originally from Sao Paulo, Brazil and Olivya Lee, a flautist and vocalist originaly from Uruguay joined Anna to create the Nightshades.",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "577723645977",
      "time":{
        "start": "19:30",
        "end": ""
      },
      "date":{
        "start": "2023-05-16",
        "end": "2023-05-16"
      },
      "location": "",
      "image": "anna-moss-and-the-nightshades.jpg",
      "image_width": "330",
      "image_height": "510",
      "stream": "",
      "youtube": "v2173grW8Bw",
      "youtube2": "uHhDqxw1LM4",
      "youtube3": "bBwrZmNWLbk",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "dirty-cello--may-29-2023",
      "title": "Dirty Cello",
      "performer": "Dirty Cello",
      "description": "“Dirty Cello’s music is all over the map: funky, carnival, romantic, sexy, tangled, electric, fiercely rhythmic” ~ Oakland Magazine",
      "details": "From Iceland to Italy, and all over the U.S., San Francisco based band [Dirty Cello](https://www.dirtycello.com/) brings the world a high energy and unique spin on blues, rock, and Americana. Led by vivacious cross-over cellist, Rebecca Roudman, Dirty Cello is cello like you’ve never heard before. From down home blues and rock with a wailing cello to virtuosic stompin’ Americana, Dirty Cello is a band that gets your heart thumping and your toes tapping!\n\n“Dirty Cello’s music is all over the map: funky, carnival, romantic, sexy, tangled, electric, fiercely rhythmic, and textured, and only occasionally classical.” ~ Oakland Magazine\n\n“The band plays every style imaginable, and does some fantastic covers. (Their rendition of “Purple Haze” is incredible.) But what is most spectacular about them is hearing the depth of soul in Roudman’s playing—it goes beyond what most people would expect from the instrument. She plays it with so much heart, you’ll wonder why more bands don’t have a cellist.” ~ Good Times Santa Cruz​\n\n“A five-piece string ensemble that truly pushes the envelope and breaks the barriers, they blend blues, bluegrass and world music sounds with roots in the world of European classical music in a style that is unique and refreshing.” ~ Cloverdale Reveille\n\n“The group seamlessly careens from blues to bluegrass and rock in a way that really shouldn't make sense but somehow does.” ~ LA Times\n\n“The ensemble plays a range of eclectic tunes in ways you won’t hear anyone else dare to attempt.” ~ Argus Courier\n\n“Anyone who's been in an audience when the San Francisco Bay Area Dirty Cello takes the stage knows that something unique happens whenever cellist Rebecca Roudman and ensemble come face to face with living, breathing (and whooping and shouting) fans.” ~ Strings Magazine",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "559799203487",
      "time":{
        "start": "20:00",
        "end": "23:00"
      },
      "date":{
        "start": "2023-05-29",
        "end": "2023-05-29"
      },
      "location": "",
      "image": "dirty-cello.jpg",
      "image_width": "600",
      "image_height": "374",
      "stream": "",
      "youtube": "K16hf1yWO7U",
      "youtube2": "GuG8dMulga4",
      "youtube3": "TlpTYsQUl5I",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "the-weeds-and-stuart-mason--mar-10-2023",
      "title": "The Weeds and Stuart Mason Live in Concert",
      "performer": "John and Tyler Weed, Stuart Mason, Marisa Gilman",
      "description": "The Weeds and Stuart Mason Live in Concert, Featuring Dance From Portland’s Marisa Gilman",
      "details": "Join father/son duo John and Tyler Weed with Stuart Mason for an evening of Celtic music, Irish dancing, and American song. The performance will feature the dancing of world champion Pacific Northwest step wizard Marisa Gilman. As is tradition, Mason and The Weeds will embark on a journey across the Atlantic, tracing the music of the Emerald Isles to one of many landing spots in the United States. Watch the folk process unfold as John Weed and “Uncle” Stuart Mason, two members of West Coast Celtic power house Molly’s Revenge and Nordic band New World String Project, pass this musical lineage to West Coast banjo, mandolin, and fiddle ace Tyler Weed. The event will feature a never heard, debut composition on tenor banjo from Tyler, a fresh voice upcoming the West Coast scene.\n\n\n**Tyler Weed** was raised in a musical family, hearing his mother and father playing fiddle since birth. Tyler has been taught guitar and banjo licks from “Uncle” Stuart Mason since his first days strumming a guitar. He was recently one of 14 students out of 1650 entrants to receive Maestro Award for improvisational soloing at the 2022 Heritage Jazz Festival in Anaheim, California. Tyler is a six time recipient of Santa Cruz Redwood Camp Teen Band scholarship, has been awarded the Big Sur Fiddle Camp scholarship twice. Tyler’s composition, “Tyler’s Ancient Jig” was featured in Molly’s Revenge’s latest release, “The Lucky Set.”\n\n**John Weed**, fiddler for Molly’s Revenge and New World String Project, is a classically-trained violinist who has spent the last 25 years immersed in various fiddle styles. With an affinity for folk traditions, John’s exploration has emphasized Irish, Scottish, Swedish, and Old-Time fiddle. While he holds a bachelor’s degree of music from CSU Chico, the musical education that charted his path began through a long series of Irish sessions. There, he learned the nuance of aural passing of melodies and the tradition of conversing in a deeply musical manner. John’s passion for the vital expressiveness of the session lead to performing across the United States and internationally. In addition to being a full time performer and instructor, John is currently on faculty at Palenke Arts, a multicultural arts organization in Seaside, California.\n\n[Stuart Mason](http://www.stuartmason.com) is known for his authentic vocals and nimble skills on guitar, mandola, and banjo. He is a member of the Celtic band Molly’s Revenge, and has performed at festivals in China, Scotland, Ireland, and many of the United States. He also tours with old time quartet SLO County Stumblers, Nordic quartet New World String Project, and in a duo with fiddler John Weed.\nStuart has won first place awards for traditional singing (Goleta Old-Time Fiddler’s Convention), mandola (Topanga Banjo and Fiddle Contest), and songwriting (West Coast Songwriter’s Association). When not gigging, he teaches, writes, and builds websites. His music blog Fiddlefreak has been going strong since 2008.",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →\nKids 12 and under FREE →",
      "price_note": "",
      "ticket": "541776065797",
      "time":{
        "start": "19:00",
        "end": "21:30"
      },
      "date":{
        "start": "2023-03-10",
        "end": "2023-03-10"
      },
      "location": "",
      "image": "the-weeds-and-stuart-mason.jpg",
      "image_width": "635",
      "image_height": "360",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": true,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "bart-budwig-the-brothers-reed-w-special-guest-meredith-lane--mar-05-2023",
      "title": "Bart Budwig & The Brothers Reed w/ special guest Meredith Lane",
      "performer": "Bart Budwig, The Brothers Reed, Meredith Lane",
      "description": "Bart Budwig and The Brothers Reed join together for a double bill of Americana with special guest Meredith Lane",
      "details": "[Bart Budwig](https://www.bartbudwig.com/)\n\n![Bart Budwig](bart-budwig.jpg) “Sometimes when Bart sings, I forget what we’re talking about. I’m sure he knows though. I trust him. He sounds like John Prine, plays like Hoyt Axton, and looks like well… Bart Budwig. He’s a cosmic country lawn gnome. He's a cosmic country lawn anome. He's cherubic, cheer, and an Old soul. Songs spring from the dreams of his noonday naps, and punch the keys of his typewnter above the OK Theater in Enterprise, Oregon. When words won't take, he calls em in with a bugle of his trumpet, or a strum of soothing quitar.”\n~Sean Jewell, American Standard Time\n\n“Bart Budwig is one of the most underrated musicians in Oregon.”\n~ Oregon Pubic Broadcasting\n\n“Cue up Budwig's melancholy brand of folk-rock n' soul, close your eyes and transport yourself to the Urs well-worn dance floor. It's a trip worn taking.”\n~ 1859, Uregons Magazine\n\n\n[The Brothers Reed](https://www.thebrothersreed.com/)\n\n![The Brothers Reed](the-brothers-reed-2.jpg) With their comedic brotherly banter, impeccable harmonic expression, and widely varying influences, a Brothers Reed performance will have you reflecting on lost lives and lovers, laughing hysterically and leaving completely entertained.\n\nThe duo incorporates harmonica, percussion, into their live performances, soothing your soul with songs that are familiar yet original. Whether they are finger picking their way through a lamentable ballad or bringing you around full-speed with a barn-burning bluegrass number, The Brothers Reed are masters of their craft.",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "505494797547",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2023-03-05",
        "end": "2023-03-05"
      },
      "location": "",
      "image": "bart-budwig-brothers-reed.jpg",
      "image_width": "800",
      "image_height": "470",
      "stream": "",
      "youtube": "-oBjGw8nSfY",
      "youtube2": "Pw7tXt7poag",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": true,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "comedy",
      "type": "performance",
      "slug": "comedy-night-w-robert-omoto--feb-18-2023",
      "title": "Comedy Night w/ Robert Omoto, Josh Barnes & Casey Moran",
      "performer": "Robert Omoto, Josh Barnes & Casey Moran",
      "description": "Robert was named a StandUp NBC semi-finalist, has been seen on America’s Funniest Videos, and on Amazon Prime.",
      "details": "[Robert “Bobby” Omoto](http://www.robertomoto.com/) has a flair for bringing the seemingly random tangents that make up his inner thought into a well oiled, if not a tad off kilter, comedy machine. His razor sharp wit combined with a ridiculous life journey, meld into a rip roaring, off the cuff entertaining comedy experience.\n\nRobert was named a StandUp NBC semi-finalist, has been seen on America’s Funniest Videos, and on Amazon Prime. He has performed at Sketchfest, the San Luis Obispo Comedy Festival, San Diego Comedy Festival, San Francisco Comedy Competition, for the U.S. Navy, and is the host/producer of the popular podcast “Random Thoughts.”\n\nHe is a regular at comedy clubs across the country and has opened for Pablo Francisco, Bret Ernst, Sarah Tiana, Rex Navarrete, TK Kirkland, Karlous Miller, Joey Medina, and Mike Epps. Robert is a rising comedian out of Sacramento, California not to be missed.",
      "note": "",
      "series": "",
      "price": "$25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "505370435577",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2023-02-18",
        "end": "2023-02-18"
      },
      "location": "",
      "image": "comedy-night-20230218.jpg",
      "image_width": "500",
      "image_height": "750",
      "stream": "",
      "youtube": "MY95SGqTqg4",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "elf-jr-the-musical--dec-16-2022",
      "title": "ELF JR - the Musical",
      "performer": "Mount Shasta Childrens Theatre",
      "description": "Based on the beloved holiday film, Mount Shasta Childrens Theatre proudly presents ELF the Musical, a hilarious comedy for the whole family. LOCATION: College of the Siskiyous, Weed.",
      "details": "Elf the Musical is the hilarious tale of Buddy, a young orphan child who mistakenly crawls into Santa’s bag of gifts and is transported back to the North Pole. Unaware that he is actually human, Buddy’s enormous size and poor toy-making abilities cause him to face the truth. With Santa’s permission, Buddy embarks on a journey to New York City to find his birth father, discover his true identity, and help New York remember the true meaning of Christmas. This modern day Christmas classic is sure to make everyone embrace their inner Elf.\n\nPerformed by 30 of the most talented young actors in the region. ELF will be, yet another, fantastic show presented by Mount Shasta Childrens Theatre. Bring the family! We'll see you there! :)",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue, $15 adv online →\nStudents/Seniors $15 at venue, $10 adv online →\nKids 8 and under FREE →",
      "price_note": "",
      "ticket": "470699935177",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-12-16",
        "end": "2022-12-16"
      },
      "location": "College of the Siskiyous,\n800 College Avenue,\nWeed, CA 96094",
      "image": "elf-the-musical.jpg",
      "image_width": "800",
      "image_height": "1036",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "slug": "elf-jr-the-musical--matinee--dec-17-2022",
      "reference_slug": "elf-jr-the-musical--dec-16-2022",
      "time":{
        "start": "15:00",
        "end": ""
      },
      "date":{
        "start": "2022-12-17",
        "end": "2022-12-17"
      }
    },
    {
      "slug": "elf-jr-the-musical--dec-17-2022",
      "reference_slug": "elf-jr-the-musical--dec-16-2022",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-12-17",
        "end": "2022-12-17"
      }
    },
    {
      "slug": "elf-jr-the-musical--matinee--dec-18-2022",
      "reference_slug": "elf-jr-the-musical--dec-16-2022",
      "time":{
        "start": "15:00",
        "end": ""
      },
      "date":{
        "start": "2022-12-18",
        "end": "2022-12-18"
      }
    },
    {
      "category": "visual-arts",
      "type": "lecture",
      "slug": "gaden-shartse-monastery-sacred-earth-and-healing-arts-of-tibet-tour-2022--oct-26-30-2022",
      "title": "Gaden Shartse Monastery Sacred Earth and Healing Arts of Tibet Tour 2022",
      "performer": "",
      "description": "We are honored to welcome the GADEN SHARTSE MONKS to Jefferson Center for the Arts. They will be spending 15 hours a day creating a sand mandala in the center of the JCA! Visitors are welcome and encouraged. They will “sweep” the mandala on Sunday October 30th.",
      "details": "![MSFoTC banner](msfotc-banner.gif)^ Mount Shasta Friends of Tibetan Culture is excited to announce that part of the Gaden Shartse Monk visit to Mount Shasta will take place at the Jefferson Center for the Arts.\n\nA schedule of lectures, dharma teachings and related empowerments will be provided as it develops. The Monks will arrive earlier on Monday October 24th and will be available for house blessings, personal healings, and astrology.\n\nJoin us for a special chance to share with all people the monks’ culture, as well as practices and paths to inner peace and compassion.\n\n ☛ An exciting and extraordinary visual arts event.\n ☛ Wednesday October 26th through Sunday October 30th 2022.\n\nVisit [MSFoTC.org](https://mountshastafriendsoftibetanculture.org/) for updates as they become available.\n#Volunteers!#\n![mandala](msfotc-mandala.jpg) Volunteers spend more time with the monks and are invited to a special pot luck dinner. We cannot do this without you!\n\n*Please contact Paula or Lobsang at friends@msfotc.org or text 530-918-8892.*\n#Giving Back#\nMSFoTC follows the wishes of H.H the 14th Dalai Lama and does not charge for teachings, lectures and most classes. This 2,500-year-old practice named Dana involves receiving teachings from the monks, and then giving the monks support in the form of offerings of food, shelter, and funds. *Our ability to offer these teachings and support Tibetan culture depends on the generosity of each of us.*\n\nWhile Theatrical performances and Art exhibits (Sand Mandalas) may have admission prices, in Mount Shasta they are often funded by grants from local foundations and generous individuals making them free to the public.\n*We deeply thank those who make this possible.*\n\n\n![MSFoTC GSCF banner](msfotc-gscf-banner.jpg)^ #Purpose of the Tour#\nThe purpose of the tour is to share with all people the monks’ culture, as well as practices and paths to inner peace and compassion. Accomplishments of previous tours have provided funds for construction of new buildings at Gaden Shartse, including the new debate hall. Additional funds raised by past tours have supported medical needs, teachers’ salaries and the day to day expenses of supporting the monastery. This success is due to the help and generosity of those who support the tours. The monks of Gaden Shartse feel deeply indebted to their friends in the West who have given their time, effort, and homes to make the tours possible. It is hoped that the upcoming tour will be a success. The Gaden Shartse Cultural Foundation is grateful for donations which may come from any source: private entities, businesses, institutions, or government grants. All donations must be paid to the order of Gaden Shartse Cultural Foundation which is a 501 (c) (3) nonprofit organization.\n\nThe success of this Tour depends on you.\n\n*Questions? Want to help? Contact Lobsang or Paula @ (530) 918-8892 or friends@msfotc.org*",
      "note": "",
      "series": "",
      "price": "",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "",
        "end": ""
      },
      "date":{
        "start": "2022-10-26",
        "end": "2022-10-30"
      },
      "location": "",
      "image": "msfotc-mandala-2.jpg",
      "image_width": "480",
      "image_height": "640",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "passport",
      "slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022",
      "title": "JCA World Music Festival (WMF) - ALL ACCESS PASS",
      "performer": "",
      "description": "This is the ALL ACCESS PASS to all 5 events of the JCA World Music Festival. Get 5 events for only $100 & receive a commemorative T-shirt - a savings of $50 from the door price: Individual event tickets are $25 online and $30 at the door.",
      "details": " ![World Music Festival lineup](wmf-2022.jpg) JCA World Music Festival ALL ACCESS PASSPORT\n\nAVAILABLE UNTIL SEPT 24TH\n\nPassport - $100\nIndividual Concerts/Events $25 online ($30 at the venue)\nThat’s five events for the price of four!\nOr a savings of $50 from the door price!\n\nYOUR TICKET = YOUR DONATION TO THE JCA.\n\n\n**Included events:**\n\n1 ☛ [Chico Latin Orquesta, Sep 24, 8PM](~/events/music/chico-latin-orquesta--jca-wmf--sep-24-2022)\n\n2 ☛ [Mount Shasta Oktoberfest, Oct 1, 12-6PM](~/events/music/mt-shasta-oktoberfest-oct-01-2022)\n\n3 ☛ [Goh Kurosawa & Shasta Taiko OCT 8TH 7PM](~/events/music/goh-kurosawa-and-shasta%20taiko--jca-wmf--oct-08-2022)\n\n4 ☛ [QUANQWA from Ethiopia, Oct 16, 7PM](~/events/music/qwanqwa-from-ethiopia--jca-wmf--oct-16-2022)\n\n5 ☛ [Arjun Verma - sitar & William Rossel - tabla, Oct 21, 8PM](~/events/music/arjun-verma-w-william-rossel--jca-wmf--oct-21-2022)\n\n\nJefferson Center for the Arts is a CA 501(c)(3) non-profit organization.\n\n\nBIG THANKS TO OUR SPONSORS!!\n[LOGE CAMPS MT SHASTA](https://www.logecamps.com/mtshasta-ca)\nand\n[PIPELINE CRAFT BEER AND FOOD](https://www.facebook.com/pages/category/Restaurant/Pipeline-Craft-Taps-and-Kitchen-385482385506720/)",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$100 adv online →\nKids 10 and under FREE →",
      "price_note": "The All Access Pass is available for purchase until September 24. Individual event tickets go on sale September 1.",
      "ticket": "408263135027",
      "time":{
        "start": "",
        "end": ""
      },
      "date":{
        "start": "2022-09-24",
        "end": "2022-09-24"
      },
      "location": "",
      "image": "jca-wmf-passport.jpg",
      "image_width": "800",
      "image_height": "800",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "/events/music/jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022",
        "expires": "2022-09-24",
        "text": "View All-Access-Pass",
        "note": "Valid for all 5 events of the World Music Festival."
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "chico-latin-orquesta--jca-wmf--sep-24-2022",
      "title": "Chico Latin Orquesta - JCA WMF",
      "performer": "Chico Latin Orquesta",
      "description": "The JCA World Music Festival presents Chico Latin Orquesta - Northern California's Premier Salsa and Cumbia Band.",
      "details": "[Chico Latin Orquesta](https://chicolatinorquesta.com/)\n\nNorthern California's Premier Latin Orchestra!\n\nFounded in Chico, California in 2019, we are passionate about bringing the Afro Caribbean rhythms of Salsa, Cumbia, Merengue and Bachata to the North State.\n\nAs individuals we are multi-instrumentalists, dancers and artists who cross many genres of music. Chico Latin Orquesta is where we come together with our different backgrounds and talents as musicians to express our own version of latin music. !Sabroso!\n\nPersonnel\n\nJoel Avalos - Lead vocals\n\nShigemi Minetaka - piano\n\nAron Linker - Bass\n\nChris Ivey aka Dr. Ivey - Trombone, vocals\n\nAlexis Barragan - Trombone, vocals\n\nEvan Goodson - Trumpet, French Horn, Guitar, Saxophone, vocals\n\nKatarra Shaw - Band Leader, Saxophone, Flute, Vocals\n\nJaik Hakkarinen - Percussion\n\nJillian Olivar - Percussion\n\nJonah Dvorin - Percussion",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$30 at venue, $25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "409580043937",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-09-24",
        "end": "2022-09-24"
      },
      "location": "",
      "image": "chicolatinorchestra-sq.jpg",
      "image_width": "800",
      "image_height": "800",
      "stream": "",
      "youtube": "fWcydMGpQ_Q",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "benefit",
      "slug": "mt-shasta-oktoberfest-oct-01-2022",
      "title": "Mount Shasta Oktoberfest - JCA WMF",
      "performer": "",
      "description": "The JCA World Music Festival presents Mount Shasta Oktoberfest! A benefit for Jefferson Center for the Arts.",
      "details": "Artisans - Entertainment - Steinholding Competition - Dance Lessons - Kids Area - Raffle",
      "note": "",
      "series": "",
      "price": "General Admission $25 →\nGeneral Admission w/out beer $15 →\nKids 10 and under FREE",
      "price_note": "Admission gets you a commemorative Oktoberfest beer stein and a ticket for your first beer! $15 tix w/out mug and beer ticket.",
      "ticket": "421612242567",
      "time":{
        "start": "12:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-10-01",
        "end": "2022-10-01"
      },
      "location": "",
      "image": "oktoberfest-20221001.jpg",
      "image_width": "600",
      "image_height": "900",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "goh-kurosawa-and-shasta taiko--jca-wmf--oct-08-2022",
      "title": "Shasta Taiko & Goh Kurosawa - JCA WMF",
      "performer": "Shasta Taiko & Goh Kurosawa",
      "description": "The JCA World Music Festival welcomes a spectacular double bill of Japanese music with Shasta Taiko and bi-cultural music samurai Goh Kurosawa.",
      "details": " ![event poster](shasta-taiko-goh-kurosawa-poster.jpg) [Shasta Taiko](https://www.facebook.com/ShastaTaiko/)\n\nShasta Taiko was founded by American taiko (Japanese drum) pioneers Jeanne Mercer and Russel Baba in 1985. Shasta Taiko has taught hundreds of Siskiyou County children and adults, exposed taiko to thousands through various performances, and presented leading American taiko artists at ShastaYama (2005-2016), the largest outdoor taiko festival in the country.\n\nShasta Taiko’s performances present original taiko compositions, some based in Japanese traditions and others from American, world, and modern influences.\n\n“Shasta Taiko...pushed the bounds of traditional music, bringing a new creativity that will carry taiko into the next generation...fashioning a new cultural and artistic tradition.” - Anchorage Daily News\n\n“...original arrangements of traditional taiko rhythms...individual solos of impressive complexity and imagination amid a clean, well crafted ensemble texture.” - San Francisco Chronicle\n\n“...what started as a casual band of family and friends in 1985 has mushroomed into Shasta Taiko...spreading a thunderous message of festivity and harmony.” - Los Angeles Times\n\n“Their (Shasta Taiko) performance was a powerful, yet very gentle, call for peace and understanding.” - Nikkei West\n\nShasta Taiko has received national attention with “Shasta Taiko,” a documentary that won a Cable “ACE” award, and featured in documentaries, “The Spirit of Taiko” and “Big Drum.”\n\nMercer and Baba started taiko in 1972 with San Francisco Taiko Dojo and Grand Master Seiichi Tanaka. As a member of Taiko Dojo, Jeanne toured worldwide and contributed to movie soundtracks “Star Wars” and “Apocalypse Now.” Russel has recorded, performed, and toured on saxophone and flutes playing original music with jazz artists pianist Andrew Hill, violinist Michael White, and drummer Eddie Moore. Russel and Jeanne continue to influence and inspire a new taiko generation and the wider taiko community\n\n\n[Goh Kurosawa](http://www.composelife.com/)\n\nScott Yanow (journalist for AllMusic & LA Jazz Scene) expresses:\n\n“International touring musician Goh Kurosawa's music is beyond any simple classification. The guitarist improvises melodically, is open to the influences of pop, rock, flamenco, classical, Latin and Japanese music, and has his own musical identity. Equally skilled on electric and acoustic guitars, he uses electrical devices to create a wide range of sounds yet is not shy to embrace a pretty melody; Goh's set included Bob Marley's No Women No Cry, My Family My Friends (original), a Japanese folk song, and Leonard Cohen's Hallelujah (which he sang).”\n\nPlaying at the Homeboy Industries (the largest gang rehabilitation and re-entry program in the world) for Christmas Fest 2021, thus far Goh has completed concerts and music workshops in Myanmar, Brazil, Mexico, Cuba, Canada, France, US, and Japan. Kurosawa has performed at the Zihuatanejo International Guitar Festival in Mexico four times, NHK and Saga Television in Japan, Spring Scream Rock Fest in Taiwan, Asian American Jazz Fest in Los Angeles, LA18 Television, as well as events affiliated with the embassies. On the cover of Pasadena Weekly, album reviewed by JazzTimes Magazine plus other publications, and during the pandemic Goh started Across Waters; an online event for music plus multi-cultural discussions with people from Japan, US, and beyond.",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$30 at venue, $25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "415683810467",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-08",
        "end": "2022-10-08"
      },
      "location": "",
      "image": "goh-kurosawa-and-shasta-taiko.jpg",
      "image_width": "771",
      "image_height": "506",
      "stream": "",
      "youtube": "a1kS7X-WbXE",
      "youtube2": "7fhStlBEer4",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "qwanqwa-from-ethiopia--jca-wmf--oct-16-2022",
      "title": "QWANQWA from Ethiopia - JCA WMF",
      "performer": "QWANQWA",
      "description": "The JCA World Music Festival presents QWANQWA from Ethiopia, on their debut US tour.",
      "details": " ![QWANQWA poster](qwanqwa-poster.jpg) [QWANQWA](https://www.qwanqwa.net/) IS A SUPERGROUP OF MUSICIANS FROM THE BADDEST ENSEMBLES OF ADDIS ABABA.\n\nBrought together by a shared passion for the power of Ethiopian music, this group shines an experimentalism based in the virtuosity of rooted traditions. With swirling masinko (one-stringed fiddle), wah-wah-violin, bass krar boom, and the unstoppable rhythm of heavy kebero (goat-skin drum) beats, powerful traditional lead African diva vocals, QWANQWA keeps the people wrapped in celebratory attention. After making a splash at world renowned festivals Roskilde and WOMEX, and after 3 European tours under their belt,  this world traveling ensemble is hitting the road for a MacArthur Foundation backed Debut US tour in 2022\n\nQWANQWA draws inspiration from East Africa regions of Ethiopia and beyond. Delving deep into regional beats and moods, the repertoire ranges from a trance-like song of the Eritrean tribe of Blen to a Somalian rock number to Mahmoud Ahmed sing-a-longs. The music is characterized by tight arrangements and extended experimental moments. The live show ranges from intimate to wild, from whispery conversations to full blown rock show, and it is hard to believe these psychedelic sounds are coming from traditional harp and violin. It is driving, powerful, and different than anything else coming out of Ethiopia at this current Golden Age of Ethiopian music.\n\nThe ensemble was founded in 2012 by American violinist Kaethe Hostetter, who first worked in Ethiopian music as a founding member of critically acclaimed Debo Band. Since relocating to Addis in 2009, she has participated in numerous exploratory and professional projects, as she honed her sound and immersed herself further into the culture of her surroundings. In this sense, QWANQWA, the Amharic word for “language,” is a project creating dialogues between cultures.\n\nCurrent members of QWANQWA are Endris Hassen (masinko), Kaethe Hostetter (violin), Bubu Teklemariam (bass krar), Selamnesh Zemene (vocalist), and Misale Legesse (kebero). They have appeared internationally with Getachew Mekuria, The EX, Thurston Moore, Fred Frith, Butch Morris, Debo Band, Nile Project, Fendika, Mahmoud Ahmed, Mulatu Astatke, Addis Acoustic, Ethiocolor, Atse Teodros, Mohammed “Jimmy” Mohammed, and Imperial Tiger Orchestra, and have played stages from Lincoln Center to Bonnaroo, Jazzfest (New Orleans), Moers Festival, Roskilde, WOMEX, WOMAD and more.\n\nAn integral and constant presence in Addis Ababa nightlife scene, QWANQWA has been featured performance at Roskilde 2016 (Northern Europe’s biggest music festival).\n\nTheir 2022 tour of US, a 48 date US tour backed by the MacArthur Foundation\n\nSince their founding in 2012, QWANQWA have released three albums: Volume One (2014) and Volume Two (2015), and Volume Three (2020).",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$30 at venue, $25 adv online →\nKids 12 and under FREE →",
      "price_note": "",
      "ticket": "421615612647",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-16",
        "end": "2022-10-16"
      },
      "location": "",
      "image": "qwanqwa.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "kweJ6svNeiw",
      "youtube2": "1cZfDh3R14I",
      "youtube3": "rDhIC-Syq-U",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "arjun-verma-w-william-rossel--jca-wmf--oct-21-2022",
      "title": "Arjun Verma & William Rossel - JCA WMF",
      "performer": "Arjun Verma & William Rossel",
      "description": "The JCA World Music Festival presents an evening of Indian music: Arjun Verma on sitar with William Rossel on tabla.",
      "details": " ![event poster](arjun-verma-w-william-rossel-poster-2.jpg) [Arjun Verma](https://www.arjun-verma.com/), sitarist, was trained by the legendary Maestro Ali Akbar Khan\n\nWith over three decades of performance experience, at venues including the United Nations (Geneva), the Fillmore (San Francisco), Fox Theater (Oakland), Pattee Arena (Monterey), the New School (New York), Birmingham Museum of Art (Birmingham), Prague Castle (Prague), and NBC Bay Area television (San Jose), Arjun has emerged with a unique voice on the sitar—both within the tradition of North Indian Classical Music, and through his innovative cross-genre collaborations.\n\nArjun has spent his entire life steeped in the tradition of North Indian Classical Music.  The son of internationally performing sitarist Roop Verma, who was a disciple of Ali Akbar Khan and Ravi Shankar, Arjun began learning sitar from his father at age five.\n\nAs a teenager, Arjun was deeply inspired by the preeminent sarode maestro, Ali Akbar Khan, and he ultimately moved to the San Francisco Bay Area to study directly with Ali Akbar Khan for eight years.  Since the Maestro’s passing in 2009, Arjun has continued his training under the able guidance of Ali Akbar Khan’s son, Alam Khan.  Arjun has also received guidance from Smt. Annapurna Devi.\n\nAs a musician of the Maihar Gharana (style) of Hindustani classical music, Arjun’s playing is based on the music of Maestro Ali Akbar Khan.  He has developed innovative sitar techniques inspired by the Maestro’s style, and is also influenced by sitarist Nikhil Banerjee.  Arjun’s playing also incorporates musical elements drawn from his long apprenticeship with his father, Roop Verma.  The combination of these influences results in a style encompassing the deeply contemplative as well as the exhilarating elements of Indian Music.\n\nArjun began performing at the age of seven, and has played concerts in the United States, Europe, and India, including performances with Pandit Swapan Chaudhuri, Sri Alam Khan, Pandit Sharda Sahai, Ustad Shabbir Nisar, Bob Weir, Salar Nader, George Brooks, Nilan Chaudhuri, Indranil Mallick, Anirban Roy Chowdhury, and members of the Houston and St. Louis Symphonies.\n\nArjun has performed in front of dignitaries including former United Nations Secretary-General Boutros Boutros-Ghali and spiritual leader Morari Bapu, and has been awarded a Mosaic Silicon Valley commissioning grant to compose for Philharmonia Baroque (2020—Sangam Arts), a Creative Work Fund grant (2018—Haas Foundation), and a Shenson Fellowship (2007—San Francisco Foundation) to support his work.\n\nCombining western classical music with Indian classical music, Arjun was the featured sitar soloist for the world premieres of Jack Perla’s River of Light (2014—Houston Grand Opera), Shalimar the Clown (2016—Opera Theatre St. Louis), and Arjun’s own Bach in Bengal (2022—Philharmonia Baroque Orchestra).\n\nAs a composer, Arjun has written commissioned works for documentary film, opera, and live performing arts, and has arranged numerous works of Indian classical music for ensembles of both Indian and non-Indian instrumentation. \n\nIn 2021, Arjun released a solo album, EPIPHANIES, exploring his very personal relationship with the sitar and Indian classical music. Recorded with cutting-edge studio technology, this album was released in HD and Ambisonic (surround) formats, raising the bar for the sound of the sitar.\n\nArjun has also recorded with GRAMMY-winning jazz arranger & pianist John Beasley, in addition to numerous recordings for Disney television.\n\nArjun’s music has received critical acclaim from leading publications, including the New York Times, Times of India, Sruti Magazine, the St. Louis Post-Dispatch, and the San Francisco Chronicle.\n\nIn addition to performing, Arjun teaches sitar and North Indian Classical Music at the Ali Akbar College of Music and the East-West School of Music.\n\n\n\n[William Rossel](http://williamrossel.com/), disciple of legendary tabla maestro Pandit Swapan Chaudhuri, is a talented tabla player, educator, composer, and inventor in the field of world music. Originally a student of Western classical vocal music, he began training in Hindustani music nearly two decades ago under sitarist Nalini Vinayak. Since 2006, he has been training under tabla maestro Pt. Swapan Chaudhuri at both the Ali Akbar College of Music and at the California Institute of the Arts where he earned a Master of Fine Arts in North Indian Classical Music, also studying Indian music theory from sarode master Ustad Aashish Khan.\n\nEqually strong on tabla as a soloist and accompanist, William has accompanied such prominent artists as Alam Khan, Arjun Verma, Suman Laha, Manik Khan, Bruce Hamm, Steve Oda, Rita Sahai, and many others. He has given numerous solo recitals and lecture demonstrations at the Ali Akbar College of Music, the Aashish Khan School of World Music, Fort Mason Center of Arts and Culture, the San Francisco Asian Art Museum, the Sangati Center, UC Berkeley, California Institute of the Arts, California College of the Arts, California Jazz Conservatory, California Polytechnic State University, Sonoma State University, Florida State University, Yuba College, Pasadena City College, and at private venues across the country.\n\nA professor of music at Yuba College, William is the director of the Yuba College North Indian Music Ensemble, which he created in 2016, and he teaches a wide range of classes, including Intro to World Music, Music as Culture, Western Music Appreciation, Popular Music of the U.S. and Applied Lessons in Percussion. William, is also a tabla instructor at the Ali Akbar College of Music and teaches rhythm theory (taal). He is also a Senior Lecturer at the California College of the Arts, in Oakland, and has directed North Indian music ensembles at the California Institute of the Arts’ Community Arts Partnership.\n\nWilliam's interests in world music have led him to study the music of Indonesia, Uganda, Tanzania, Ghana, and many others. He spent half a year in a remote village in northern Bali, conducting field research and training under master musicians I Made Terip and I Putu Putrawan and was a member of Sekar Jaya, a world-renowned Gamelan ensemble, playing in their Gong Kebyar, Anklung, Joged and Jegog ensembles. Other musicians William has studied under include Randy Gloss, I Nyoman Wenten, Andrew Grueschow, Houman Pourmehdi, Alfred Ladzekpo, Damascus Kafumbe, Dr. Michael Bakan and Dr. Frank Gunderson.\n\nAdditionally, William directs music workshops for students with autism and other developmental differences through Youth In Arts, a leading arts education non-profit organization.\n\nWilliam is the inventor of the Tihai Clock, a mechanical means of completely representing the many rhythmic cadences of Hindustani music, known as tihai. He lives in San Anselmo, California where he teaches Tabla privately.",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$30 at venue, $25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "421621811187",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-21",
        "end": "2022-10-21"
      },
      "location": "",
      "image": "arjun-verma-w-william-rossel.jpg",
      "image_width": "800",
      "image_height": "569",
      "stream": "",
      "youtube": "MIII8Utzl-w",
      "youtube2": "gMRZs0NOvMY",
      "youtube3": "-biAkaKIqtw",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "tony-mcmanus-legendary-celtic-guitarist--sep-13-2022",
      "title": "Tony McManus - legendary Celtic guitarist",
      "performer": "Tony McManus",
      "description": "Hailed by John Renbourn as ’the best Celtic guitarist in the world’ Tony McManus will grace the JCA Stage Tuesday evening Sept 13th at 8pm",
      "details": "“Tonys music is beyond beautiful… its perfect” ~Tommy Emmanuel\n\n[Tony McManus](https://tonymcmanus.com) has also been listed as one of the 50 transcendent guitarists of all time by Guitar Player Magazine. Tony has both extended and transcended the parameters of contemporary Celtic music. Ranked by peers and predecessors alike alongside the guitar world’s all-time greats, his fiendishly dexterous, dazzlingly original playing draws on traditions from the entire Celtic world, along with still further-ranging flavours such as jazz and eastern European music. Long applauded for his uncanny ability to transpose the delicate, complex ornamentation characteristic of traditional bagpipe or fiddle tunes – even the phrasing of a Gaelic song – onto his own six strings, McManus is increasingly being acknowledged also as a pioneering figure in bridging the realms of Celtic music and other guitar genres.\n\nBorn in 1965 in Paisley, near Glasgow, McManus was introduced to traditional music via the family record collection. Having first tried his hand at the fiddle, whistle and mandolin, he took up the guitar aged ten, although subsequent academic inclinations got him halfway through a PhD in maths before the music won out. After rapidly making his name as an unusually fluent and sensitive accompanist, he took the solo plunge with a triumphant main-stage debut on the final night of Glasgow’s inaugural Celtic Connections festival in 1994, supporting Capercaillie in front of a 2500-strong crowd.\n\nWith the loyal support of Greentrax Recordings in Scotland Tony’s first self-titled recording in 1996, followed by Pourquoi Quebec in 1999 led to worldwide recognition. However, it was with the release of Ceol More in 2002 that Tony’s stature as a first-class musician reached a new level. Having heard his session work on several albums, Nashville based Compass Records released “Ceol More” in North America to universally ecstatic reviews. Critics hailed the focused, spell-binding nature of the music, from the plaintive Jewish hymn “Shalom Aleichem” to the ingenious arrangement of the Charles Mingus tune “Goodbye Pork Pie Hat”. Having been nominated as Musician of the Year by both the BBC Folk Awards and The Scottish Traditional Music awards, in 2002 “Ceol More” hit the Critic’s Album of the year list in Acoustic Guitar magazine and was named Live Ireland Awards' Album of the Year.\n\nIn a relatively short time Tony’s music has come to define a new role for the guitar in Celtic music. He has come to represent Celtic music in the guitar world, making regular appearances at guitar specific f.festivals such as the Chet Atkins Festival in Nashville; the Ellnora Guitar Festival in one of Illinois's most prestigious venues, the Krannert Center, with the likes of Pat Metheny, Kaki King, Molly Tuttle, and Steve Dawson; has appeared at Guitar Festivals in Soave and Pescantina, Italy; Frankston, Australia; Issoudun, France; Kirkmichael, Scotland; Bath and Kent, England; Bochum and Osnabruck, Germanyand has taught at five of Steve Kaufman’s Acoustic Kamps in Maryville, Tennessee. He performed at the famous Ryman Auditorium in Nashville in the “All Star Guitar Night” featuring Steve Morse, Bryan Sutton, Muriel Anderson, Béla Fleck and Victor Wooten and headlined by the legendary Les Paul. His ability to reach audiences unfamiliar with traditional music is remarkable - he is quite comfortable at predominantly classical events such as the Dundee and Derry Guitar Festivals (appearing six times between the two) and even The Bogotá International Guitar Festival where he followed virtuoso Eduardo Fernandez. He is also a signature artist for PRS Guitars in Maryland, and has performed at their venue with Carlos Santana, among others. These days Tony has a busy tour schedule, but he also authors books on Celtic guitar, and is in demand for workshops and lessons.",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue, $25 adv online →\nStudents/Seniors $25 at venue, $20 adv online →\nKids 12 and under FREE →",
      "price_note": "",
      "ticket": "408257859247",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-09-13",
        "end": "2022-09-13"
      },
      "location": "",
      "image": "tony-mcmanus.jpg",
      "image_width": "800",
      "image_height": "534",
      "stream": "",
      "youtube": "ID9GWTDFUoI",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "blu-egyptian--aug-25-2022",
      "title": "Blü Egyptian Outdoor Show",
      "performer": "Blü Egyptian",
      "description": "Blü Egyptian …Chico based funk world bluegrass band is coming to Mount Shasta play the JCA field on August 25th!",
      "details": "Grab your dancing shoes and come out to the JCA field on Thursday evening August 25th Tickets $10 advance $15 at the gate. JCA Bar on site bring a chair a blanket. Picnics are welcome. Dancing is vital! Gates open at 6:30. See you there!\n\n[Blü Egyptian](https://www.bluegyptianband.com/) from Chico, Ca, play original music encompassing bluegrass, rock, funk, latin and reggae for the ultimate dance party!\n\nFormed in 2020, Blü Egyptian are friends who met in the recording arts classes in high school and then became a band when the school closed during the pandemic. During that time, they streamed live on Twitch and released a 4-song EP in January 2021. They released their first full length s/t album “Blü Egyptian” in June 2021 and have been touring throughout Northern California since. The new album “Dame Un Segundo” was released in May 2022. They have been touring throughout Northern California this summer playing at many festivals including High Sierra Music Festival, Hogfarm Hideaway, Feather River Flowdown, Owlfest X and California Worldfest.",
      "note": "Gates open at 6:30",
      "series": "",
      "price": "$15 at venue / $10 adv online →",
      "price_note": "",
      "ticket": "399648979857",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-08-25",
        "end": "2022-08-25"
      },
      "location": "",
      "image": "blu-egyptian.jpg",
      "image_width": "720",
      "image_height": "720",
      "stream": "",
      "youtube": "X7xuqJDR95c",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": true,
        "is_excluded": true
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "alice-in-wonderland--aug-05-2022",
      "title": "Alice In Wonderland",
      "performer": "Mt Shasta Childrens Theatre",
      "description": "Mt Shasta Childrens Theatre presents ALICE IN WONDERLAND, the 9th Annual Broadway Camp Musical Performance.",
      "details": "This brand-new musical version of the timeless classic takes you down the rabbit hole with the ever-curious Alice to a land of zany adventures where nothing is as it seems. The White Rabbit, Tweedle-Dee and Tweedle-Dum, the Mad Hatter, the Caterpillar, the Mock Turtle, the mysterious Cheshire Cat, the Queen of Hearts, and all your favorites from Lewis Carroll’s beloved books make this a magical, tuneful, and over-the-top entertaining musical for the whole family!",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue, $15 adv online →\nStudents/Seniors $15 at venue, $10 adv online →\nKids 8 and under FREE →",
      "price_note": "",
      "ticket": "382655993377",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-05",
        "end": "2022-08-05"
      },
      "location": "",
      "image": "alice-in-wonderland.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "slug": "alice-in-wonderland-matinee--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-07-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-07",
        "end": "2022-08-07"
      }
    },
    {
      "category": "music",
      "type": "dance party",
      "slug": "catch-rabbit-sprig--jul-28-2022",
      "title": "Catch Rabbit & Sprig",
      "performer": "Catch Rabbit, Sprig",
      "description": "A FREE outdoors dance party for all ages. Seattle based Catch Rabbit is a psychedelic art-pop project. Sprig opens. An evening of unique and pleasurable musical theatrics.",
      "details": "**CATCH RABBIT**\n\nis the faint aroma of cotton candy in a swirling circus of pleasure. Catch Rabbit is the moment you wake up, when the dream world barges into the real world only to vanish in a puff of glitter. Catch Rabbit is your butt—your personal, literal butt—vibing rhythmically to the symphony of your feelings.\n\nTheir self-titled debut cassette is out now on Den Tapes. Buy the tape to hear Better Angels, Nobody Really Knows and Autumnesque, plus 5 more unheard tracks!\n\n“Would sound real good blasting from a car radio as you do a little Summertime cruise on Alki Beach” - DJ nstop, Hollow Earth Radio\n\n“Recommended for living in a kaleidoscope” - The Tape Deck\n\n\n**SPRIG**\n\nBe The Queercoded Villain You Wanted to Date as a Child.\n\nIt's campy synthy buttrock for girls TM\n\nChristiana is a dumbass ecogoth who writes the songs and does keytar.\n\nDrew Shreve is a powerful drum slut with a growing synth kink.\n\nSara does Viola! She does guitar! She does weird things to my feet!\n\nWatch Out\n\nDrea is our vers goddess of bass, synths, keys, percussion and KINDNESS",
      "note": "",
      "series": "",
      "price": "free admission",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-28",
        "end": "2022-07-28"
      },
      "location": "",
      "image": "catch-rabbit-sprig.jpg",
      "image_width": "700",
      "image_height": "400",
      "stream": "",
      "youtube": "bVDriykl9Ds",
      "youtube2": "9bCjY8VNtAo",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "pato-banton-reggae-show-outdoors--jul-19-2022",
      "title": "Pato Banton reggae show outdoors",
      "performer": "Pato Banton",
      "description": "Reggae Legend Pato Banton Live in Mt Shasta for an Outdoor Show.",
      "details": "[Pato Banton](https://officialpatobanton.com/) is a grammy nominated reggae legend that has recorded and toured the world with The English Beat, Steel Pulse, UB40 & STING! (just to name a few) . During the year 2000, while in the midst of a global trek with Peter Gabriel’s WOMAD organization, that combined huge festivals with music outreach programs to poor and underprivileged communities, Pato learned that two of his sons had been shot in a drive-by shooting! He immediately put his career on hold and turned his sorrow into the impetus for community & educational initiatives that would consume the next six years of his life.\n\nPato created an organization called “Musical Connections” and in partnership the Community Safety Team, provided tuition and counseling for “at risk” young people in 16 different communities across his city of Birmingham, UK. This project was so successful that Pato was approached by the West Midlands Police Department to tackle the ongoing problem of gun crime in some of the poorest neighborhoods. Within a few years this partnership greatly reduced gun crime across the entire city and Pato was given a Lifetime Achievement Award by the BBC and entered into the British Music Hall of Fame during the same year.\n\nIn 2006, after feeling that he had planted enough seeds of progress within his home community, Pato decided to relocate to Southern California and embark on the second phase of his musical journey, taking with him the years of experience in the field of Loving Service. Since then Pato has recorded many albums and collaborated with artists all over the world. His most recent albums Love Is The Greatest & The Words Of Rastafari were released on Bob Marley’s Tuff Gong Records International.\n\nPato Banton’s four-decade public presence has increasingly transcended music to convey a positive & uplifting message of global peace and love for humanity. Now based in Southern California, he continues to record and tour the world extensively with his band The Now Generation, while simultaneously serving as a Teacher, Minister, Counselor and Mentor to his Fans, Friends & Family worldwide!",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "377510362657",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-19",
        "end": "2022-07-19"
      },
      "location": "",
      "image": "pato-banton.jpg",
      "image_width": "800",
      "image_height": "533",
      "stream": "",
      "youtube": "2qG5PlhdCMU",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "summit",
      "type": "gathering",
      "slug": "mt-shasta-star-knowledge-peace-summit--aug-12-15-2022",
      "title": "Mt. Shasta Star Knowledge Peace Summit",
      "performer": "",
      "description": "Three days of Wisdom Keepers, Music & Dance. We/You, are all Sacred Beings. Let’s Unite in Prayer & Peace to help change the Planet.\nEarly bird special until 7/7/22 at 7:00PM.",
      "details": "Do you hear the calling to Mount Shasta? We would love for you to join us.\n\nMount Shasta is a sacred place, a dimensional Doorway to the frequency of Love, let us join together to open our hearts to pure love and Bliss.\n\nShasta is a mirror that shows us the purity of who we truly are are.\n\n\nAll Nations - All Races - All Our Relations\n\n\n**Speakers**\n\nAlway our in Spirit Leader Chief Golden Light Eagle Loren Zephier.\n\nTerri (Sings with Ravens) Rivera\n\nCarla Poluha\n\nFumi Johns Stewart\n\n**Co-Host** Dr. Arthur Robert Cushman (Tata Arturo) (Arturo Luminoso Ketzal Tlanetzia)\n\nJose Federico Munoz\n\nNikki Zephier South Dakota Daughter of Chief Golden Light Eagle\n\nBlue Hail Matthew D Campbell Jr. Head Singer Star Knowledge Drum\n\nHead Dancer Tata Cuco Murillo from Tecate, Baja California (tentative)\n\nLuis Antonio Fernandez Razo\n\nWash Chimalli ( Nahuatl)\n\nMexika Wisdom Keeper From Meshico Tenochtitlan ( Mexico 🇲🇽 City)\n\nDanza Ameyaltzin Yolihuani\n\nAunty Pooki Lee\n\nLeza Vivio\n\nBishop Darrell Nichols\n\nGeri LittleJohn\n\nMartha Elena Sáenz\n\nLauraSa Pele Lafoia Ava\n\nClaudia Tomasiewicz\n\nJen Noel\n\nBill Homann & The Mitchell-Hedges Crystal Skull\n\nFULL DETAILS on [eventbrite ticket website](https://www.eventbrite.com/e/mt-shasta-star-knowledge-peace-summit-immersion-tickets-159043905603)",
      "note": "",
      "series": "",
      "price": "$222 early bird special / $333 after July 7 →",
      "price_note": "Early bird special until 7/7/22 at 7:00PM",
      "ticket": "159043905603",
      "time":{
        "start": "09:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-08-12",
        "end": "2022-08-15"
      },
      "location": "",
      "image": "star-knowledge-peace-summit.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "comedy-night-jun-18-2022",
      "title": "Comedy Night at the JCA",
      "performer": "Shannon Battle, Jen Jay, Nick Meier",
      "description": "JCA Presents COMEDY NIGHT with headliner Shannon Battle. Featuring Jen Jay, Hosted by Nick Meier.",
      "details": "Three hilarious comics coming to Mt Shasta\n\n[Shannon “Funny” Battle](https://www.instagram.com/shannon_battle_funny/)\n\nJen Jay - 2nd place winner of Eugene, Oregons Funniest People 2021\n\nNick Meier - A sexually charged human sized hard-boiled egg of a comedian.",
      "note": "",
      "series": "Comedy Night",
      "price": "$20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "359777081937",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-06-18",
        "end": "2022-06-18"
      },
      "location": "",
      "image": "comedy-night-20220618.jpg",
      "image_width": "750",
      "image_height": "950",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    }
  ]
}