{
  "schema":
  {
    "category": "music|visual-arts|theater|fest|summit",
    "type": "performance|class|workshop|lecture|exhibition|benefit|gathering",
    "slug": "dashed-title--mmm-dd-2022",
    "title": "",
    "performer": "",
    "description": "",
    "details": "",
    "note": "",
    "series": "",
    "price": "$20 at venue / $15 adv online →",
    "price_note": "---Online ticket purchase link to be added soon---",
    "ticket": "",
    "time":{
      "start": "hh:mm",
      "end": ""
    },
    "date":{
      "start": "2022-mm-dd",
      "end": "2022-mm-dd"
    },
    "location": "",
    "image": "",
    "image_width": "800",
    "image_height": "",
    "stream": "",
    "youtube": "",
    "youtube2": "",
    "youtube3": "",
    "flag": {
      "show_registration_form": false,
      "is_outdoors": false,
      "is_postponed": false,
      "is_canceled": false,
      "is_excluded": false
    },
    "stamp": "",
    "stamp_summary": "",
    "sponsor_text": "",
    "sponsor_image": "",
    "reference_slug": "",
    "all_access_slug": ""
  },
  "events":[
    {
      "category": "music",
      "type": "performance",
      "slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022",
      "title": "JCA World Music Festival (WMF) - ALL ACCESS PASS",
      "performer": "",
      "description": "ALL ACCESS PASS to all 5 events of the JCA World Music Festival",
      "details": "JCA WORLD MUSIC FESTIVAL ALL ACCESS PASSPORT\n\nAVAILABLE UNTIL SEPT 24TH\n\nPassport - $100\nIndividual Concerts/Events $25\nThat’s five events for the price of four!\n\nYOUR TICKET=YOUR DONATION TO THE JCA.\n\n☛ [CHICO LATINO ORQUESTRA SEPT 24TH 8PM](~/events/music/chico-latin-orquestra--jca-wmf--sep-24-2022)\n\n☛ [OKTOBERFEST! OCT 1ST 12-6PM](~/events/music/mt-shasta-oktoberfest-oct-01-2022)\n\n☛ [GOH KUROSAWA & SHASTA TAIKO OCT 8TH 7PM](~/events/music/goh-kurosawa-and-shasta%20taiko--jca-wmf--oct-08-2022)\n\n☛ [QUANQWA OCT 16TH 7PM](~/events/music/qwanqwa-from-ethiopia--jca-wmf--oct-16-2022)\n\n☛ [ARJUN VERMA-SITAR & WILLIAM ROSSEL-TABLA OCT 21ST 8PM](~/events/music/arjun-verma-w-william-rossel--jca-wmf--oct-21-2022)\n\n\nJefferson Center for the Arts is a CA 501(c)(3) non-profit organization.\n\n\nBIG THANKS TO OUR SPONSORS!!\n[LOGE CAMPS MT SHASTA](https://www.logecamps.com/mtshasta-ca)\nand\n[PIPELINE CRAFT BEER AND FOOD](https://www.facebook.com/pages/category/Restaurant/Pipeline-Craft-Taps-and-Kitchen-385482385506720/)",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$100 adv online →\nKids 10 and under FREE →",
      "price_note": "5 events for only $100 & receive a commemorative T-shirt. (Individual event tickets are $25)",
      "ticket": "",
      "time":{
        "start": "",
        "end": ""
      },
      "date":{
        "start": "2022-09-24",
        "end": "2022-10-21"
      },
      "location": "",
      "image": "wmf-2022-passport.jpg",
      "image_width": "630",
      "image_height": "576",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "chico-latin-orquestra--jca-wmf--sep-24-2022",
      "title": "Chico Latin Orquestra - JCA WMF",
      "performer": "Chico Latin Orquestra",
      "description": "The JCA World Music Festival presents Chico Latin Orquestra - Northern California's Premier Salsa and Cumbia Band",
      "details": "[Chico Latin Orquestra](https://chicolatinorquesta.com/)\n\nNorthern California's Premier Latin Orchestra!\n\nFounded in Chico, California in 2019, we are passionate about bringing the Afro Caribbean rhythms of Salsa, Cumbia, Merengue and Bachata to the North State.\n\nAs individuals we are multi-instrumentalists, dancers and artists who cross many genres of music. Chico Latin Orquesta is where we come together with our different backgrounds and talents as musicians to express our own version of latin music. !Sabroso!\n\nPersonnel\n\nJoel Avalos - Lead vocals\n\nShigemi Minetaka - piano\n\nAron Linker - Bass\n\nChris Ivey aka Dr. Ivey - Trombone, vocals\n\nAlexis Barragan - Trombone, vocals\n\nEvan Goodson - Trumpet, French Horn, Guitar, Saxophone, vocals\n\nKatarra Shaw - Band Leader, Saxophone, Flute, Vocals\n\nJaik Hakkarinen - Percussion\n\nJillian Olivar - Percussion\n\nJonah Dvorin - Percussion",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-09-24",
        "end": "2022-09-24"
      },
      "location": "",
      "image": "chicolatinorchestra-sq.jpg",
      "image_width": "800",
      "image_height": "800",
      "stream": "",
      "youtube": "fWcydMGpQ_Q",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "benefit",
      "slug": "mt-shasta-oktoberfest-oct-01-2022",
      "title": "Mount Shasta Oktoberfest - JCA WMF",
      "performer": "",
      "description": "Save the date! More info comming soon.",
      "details": "",
      "note": "",
      "series": "",
      "price": "$25 adv online →\nKids 10 and under FREE →",
      "price_note": "---Online ticket purchase link to be added September 1st---",
      "ticket": "",
      "time":{
        "start": "12:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-10-01",
        "end": "2022-10-01"
      },
      "location": "",
      "image": "oktober-fest-20221001.jpg",
      "image_width": "600",
      "image_height": "929",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "goh-kurosawa-and-shasta taiko--jca-wmf--oct-08-2022",
      "title": "Goh Kurosawa & Shasta Taiko - JCA WMF",
      "performer": "Goh Kurosawa & Shasta Taiko",
      "description": "The JCA World Music Festival presents Goh Kurosawa & Shasta Taiko",
      "details": "[Goh Kurosawa](http://www.composelife.com/)\n\nResiding in Los Angeles and travelling the world from Japan, Kurosawa is a musician armed with Honey Beast (his guitar), Lucky8 (his amp), fresh original songs, electrifying soundscapes, and stunning arrangements of familiar global melodies.\n\n”This year once again, please take me for who I am.” =「 今年も、よろしくお願いします。」\n\nReferred to by many as the Bicultural Music Samurai, all throughout his life, Goh has been working to share honest stories and life connections though music, and his current tour is called Lovetap Tour (previously known as Broken Tour). \n\n“It’s easy… it’s not hard… it’s fun!!!”\n\nHaving performed in a wide range of settings and festivals (for music, art, movement, schools, community centers, and public libraries), Goh has completed more than 20 tours in Japan since 2006, and has been conducting music workshops/seminars at universities, music schools, and other educational institutions. While at home in Los Angeles, in addition to the daily music activities, Goh works at a local food bank in Pasadena California by serving fresh food and everyday necessities to the community; while on tour, he frequents the Pacific Northwest (Seattle and Portland areas) and the Route 66 for seasonal performances. In addition, during the 2020 pandemic, he launched an online event with music and conversations (English & Japanese) called Across Waters. He has been actively touring locally and internationally since 2005, and recently completed two performances in Cuba at the historical Teatro Martí as well as the new and modern Fabrica de Arte Cubano. Both events were promoted by the Japanese Embassy in Cuba as a part of the 120th year anniversary celebration, commemorating the first Japanese immigration on September 9th, 1898. To keep reaching wider and farther, Goh is continuing to make effort to recognize all environments in which music could shine.\n\n“Two important things as an artist... doing good art & building relationships.”\n--Pete Morris (Metro DaVinci Watercolors)\n\nGoh’s audience recognizes various expressive emotions while listening to his recordings and especially by experiencing him live. People have identified his music with concepts such as acoustic, rock, jazz, dance music, sit-down music, tap-slap, Brazilian bossa nova, Spanish flamenco, hip-hop beats, Latin grooves, Balkan rhythms, Electronica-sound-effects, prog-rock, metal, experimental, classical, and the “Yamato Soul (大和魂)” of Japan. To simplify, call it acoustic rock jazz. Goh continues his journey towards his own heart, sound, and soul.  \n\n“Stay true to yourself.”\n\n--Clare Graham (Artist/Collector/Shaman)\n\nUnplugged, Goh embraces a single guitar to create an orchestra with drum beats, percussive grooves, bass lines, and memorable melodies. As an electric pedalist he tweaks, bends, and twists soundscapes. He puts on high energy performances along with elegantly powerful acoustic sounds and traditional classical chamber gestures; he is quiet, and he is loud. Life experiences and vivid awakenings are the primary sources of Goh’s songs; musical and technical influences would include everything and everyone from Paco de Lucia (flamenco) to creative jazz to high-gained biting electric guitar distortions to world percussionists and rock drummers.\n\n“Don't hold back.”\n\n--Adam Levy (of Norah Jones’ Handsome Band)\n\nScott Yanow (journalist for AllMusic & LA Jazz Scene) expresses: “Goh Kurosawa's music is beyond any simple classification. The guitarist improvises melodically, is open to the influences of pop, rock, flamenco, classical, Latin and Japanese music, and has his own musical identity. Equally skilled on electric and acoustic guitars, he has mastered tapping and sometimes uses electrical devices to create a wide range of sounds yet is not shy to embrace a pretty melody; personable and eager to talk about his music and guitar tunings between songs, Goh put on a warm and entertaining show. His set included Bob Marley's No Women No Cry, My Family My Friends (original), a Japanese folk song, Leonard Cohen's Hallelujah (which he sang) and parts of a suite he recently composed.”\n\n“Sharpness is kindness, kindness is sharpness.”\n\nKurosawa is often referred to as the “Musical Wakonyosai (音の和魂洋才)” or the Bicultural Music Samurai. Wakonyosai (和魂洋才) is an approach to the Western knowledge with the Japanese spirit. Overall, he views himself as a world citizen, and lives in a countryside in the city of angels with Nyan Nyan, his blue eyed white tiger cat… send a note just to say hi, or send an offer for bookings (contact info at the bottom of this page). \n\n“Keep it simple, believe, and live every day.”\n\nGoh continues to be on the lookout to compose life.\n\n\n[Shasta Taiko](https://www.facebook.com/ShastaTaiko/)\n\nShasta Taiko is a nonprofit public benefit corporation organized under the Nonprofit Public Benefit Corporation Law for charitable purposes. Shasta Taiko goal is to teach, promote and present the art of Japanese drumming, the art of Taiko.",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-08",
        "end": "2022-10-08"
      },
      "location": "",
      "image": "goh-kurosawa-and-shasta-taiko.jpg",
      "image_width": "771",
      "image_height": "506",
      "stream": "",
      "youtube": "7fhStlBEer4",
      "youtube2": "a1kS7X-WbXE",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "qwanqwa-from-ethiopia--jca-wmf--oct-16-2022",
      "title": "QWANQWA from Ethiopia - JCA WMF",
      "performer": "QWANQWA",
      "description": "The JCA World Music Festival presents QWANQWA from Ethiopia",
      "details": "[QWANQWA](https://www.qwanqwa.net/) IS A SUPERGROUP OF MUSICIANS FROM THE BADDEST ENSEMBLES OF ADDIS ABABA.\n\nBrought together by a shared passion for the power of Ethiopian music, this group shines an experimentalism based in the virtuosity of rooted traditions. With swirling masinko (one-stringed fiddle), wah-wah-violin, bass krar boom, and the unstoppable rhythm of heavy kebero (goat-skin drum) beats, powerful traditional lead African diva vocals, QWANQWA keeps the people wrapped in celebratory attention. After making a splash at world renowned festivals Roskilde and WOMEX, and after 3 European tours under their belt,  this world traveling ensemble is hitting the road for a MacArthur Foundation backed Debut US tour in 2022\n\nQWANQWA draws inspiration from East Africa regions of Ethiopia and beyond. Delving deep into regional beats and moods, the repertoire ranges from a trance-like song of the Eritrean tribe of Blen to a Somalian rock number to Mahmoud Ahmed sing-a-longs. The music is characterized by tight arrangements and extended experimental moments. The live show ranges from intimate to wild, from whispery conversations to full blown rock show, and it is hard to believe these psychedelic sounds are coming from traditional harp and violin. It is driving, powerful, and different than anything else coming out of Ethiopia at this current Golden Age of Ethiopian music.\n\nThe ensemble was founded in 2012 by American violinist Kaethe Hostetter, who first worked in Ethiopian music as a founding member of critically acclaimed Debo Band. Since relocating to Addis in 2009, she has participated in numerous exploratory and professional projects, as she honed her sound and immersed herself further into the culture of her surroundings. In this sense, QWANQWA, the Amharic word for “language,” is a project creating dialogues between cultures.\n\nCurrent members of QWANQWA are Endris Hassen (masinko), Kaethe Hostetter (violin), Bubu Teklemariam (bass krar), Selamnesh Zemene (vocalist), and Misale Legesse (kebero). They have appeared internationally with Getachew Mekuria, The EX, Thurston Moore, Fred Frith, Butch Morris, Debo Band, Nile Project, Fendika, Mahmoud Ahmed, Mulatu Astatke, Addis Acoustic, Ethiocolor, Atse Teodros, Mohammed “Jimmy” Mohammed, and Imperial Tiger Orchestra, and have played stages from Lincoln Center to Bonnaroo, Jazzfest (New Orleans), Moers Festival, Roskilde, WOMEX, WOMAD and more.\n\nAn integral and constant presence in Addis Ababa nightlife scene, QWANQWA has been featured performance at Roskilde 2016 (Northern Europe’s biggest music festival).\n\nTheir 2022 tour of US, a 48 date US tour backed by the MacArthur Foundation\n\nSince their founding in 2012, QWANQWA have released three albums: Volume One (2014) and Volume Two (2015), and Volume Three (2020).",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-16",
        "end": "2022-10-16"
      },
      "location": "",
      "image": "qwanqwa.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "kweJ6svNeiw",
      "youtube2": "1cZfDh3R14I",
      "youtube3": "rDhIC-Syq-U",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "arjun-verma-w-william-rossel--jca-wmf--oct-21-2022",
      "title": "Arjun Verma & William Rossel - JCA WMF",
      "performer": "Arjun Verma & William Rossel",
      "description": "The JCA World Music Festival presents Arjun Verma on sitar with William Rossel on tabla.",
      "details": "[Arjun Verma](https://www.arjun-verma.com/), sitarist, was trained by the legendary Maestro Ali Akbar Khan\n\nWith over three decades of performance experience, at venues including the United Nations (Geneva), the Fillmore (San Francisco), Fox Theater (Oakland), Pattee Arena (Monterey), the New School (New York), Birmingham Museum of Art (Birmingham), Prague Castle (Prague), and NBC Bay Area television (San Jose), Arjun has emerged with a unique voice on the sitar—both within the tradition of North Indian Classical Music, and through his innovative cross-genre collaborations.\n\nArjun has spent his entire life steeped in the tradition of North Indian Classical Music.  The son of internationally performing sitarist Roop Verma, who was a disciple of Ali Akbar Khan and Ravi Shankar, Arjun began learning sitar from his father at age five.\n\nAs a teenager, Arjun was deeply inspired by the preeminent sarode maestro, Ali Akbar Khan, and he ultimately moved to the San Francisco Bay Area to study directly with Ali Akbar Khan for eight years.  Since the Maestro’s passing in 2009, Arjun has continued his training under the able guidance of Ali Akbar Khan’s son, Alam Khan.  Arjun has also received guidance from Smt. Annapurna Devi.\n\nAs a musician of the Maihar Gharana (style) of Hindustani classical music, Arjun’s playing is based on the music of Maestro Ali Akbar Khan.  He has developed innovative sitar techniques inspired by the Maestro’s style, and is also influenced by sitarist Nikhil Banerjee.  Arjun’s playing also incorporates musical elements drawn from his long apprenticeship with his father, Roop Verma.  The combination of these influences results in a style encompassing the deeply contemplative as well as the exhilarating elements of Indian Music.\n\nArjun began performing at the age of seven, and has played concerts in the United States, Europe, and India, including performances with Pandit Swapan Chaudhuri, Sri Alam Khan, Pandit Sharda Sahai, Ustad Shabbir Nisar, Bob Weir, Salar Nader, George Brooks, Nilan Chaudhuri, Indranil Mallick, Anirban Roy Chowdhury, and members of the Houston and St. Louis Symphonies.\n\nArjun has performed in front of dignitaries including former United Nations Secretary-General Boutros Boutros-Ghali and spiritual leader Morari Bapu, and has been awarded a Mosaic Silicon Valley commissioning grant to compose for Philharmonia Baroque (2020—Sangam Arts), a Creative Work Fund grant (2018—Haas Foundation), and a Shenson Fellowship (2007—San Francisco Foundation) to support his work.\n\nCombining western classical music with Indian classical music, Arjun was the featured sitar soloist for the world premieres of Jack Perla’s River of Light (2014—Houston Grand Opera), Shalimar the Clown (2016—Opera Theatre St. Louis), and Arjun’s own Bach in Bengal (2022—Philharmonia Baroque Orchestra).\n\nAs a composer, Arjun has written commissioned works for documentary film, opera, and live performing arts, and has arranged numerous works of Indian classical music for ensembles of both Indian and non-Indian instrumentation. \n\nIn 2021, Arjun released a solo album, EPIPHANIES, exploring his very personal relationship with the sitar and Indian classical music. Recorded with cutting-edge studio technology, this album was released in HD and Ambisonic (surround) formats, raising the bar for the sound of the sitar.\n\nArjun has also recorded with GRAMMY-winning jazz arranger & pianist John Beasley, in addition to numerous recordings for Disney television.\n\nArjun’s music has received critical acclaim from leading publications, including the New York Times, Times of India, Sruti Magazine, the St. Louis Post-Dispatch, and the San Francisco Chronicle.\n\nIn addition to performing, Arjun teaches sitar and North Indian Classical Music at the Ali Akbar College of Music and the East-West School of Music.\n\n\n\n[William Rossel](http://williamrossel.com/), disciple of legendary tabla maestro Pandit Swapan Chaudhuri, is a talented tabla player, educator, composer, and inventor in the field of world music. Originally a student of Western classical vocal music, he began training in Hindustani music nearly two decades ago under sitarist Nalini Vinayak. Since 2006, he has been training under tabla maestro Pt. Swapan Chaudhuri at both the Ali Akbar College of Music and at the California Institute of the Arts where he earned a Master of Fine Arts in North Indian Classical Music, also studying Indian music theory from sarode master Ustad Aashish Khan.\n\nEqually strong on tabla as a soloist and accompanist, William has accompanied such prominent artists as Alam Khan, Arjun Verma, Suman Laha, Manik Khan, Bruce Hamm, Steve Oda, Rita Sahai, and many others. He has given numerous solo recitals and lecture demonstrations at the Ali Akbar College of Music, the Aashish Khan School of World Music, Fort Mason Center of Arts and Culture, the San Francisco Asian Art Museum, the Sangati Center, UC Berkeley, California Institute of the Arts, California College of the Arts, California Jazz Conservatory, California Polytechnic State University, Sonoma State University, Florida State University, Yuba College, Pasadena City College, and at private venues across the country.\n\nA professor of music at Yuba College, William is the director of the Yuba College North Indian Music Ensemble, which he created in 2016, and he teaches a wide range of classes, including Intro to World Music, Music as Culture, Western Music Appreciation, Popular Music of the U.S. and Applied Lessons in Percussion. William, is also a tabla instructor at the Ali Akbar College of Music and teaches rhythm theory (taal). He is also a Senior Lecturer at the California College of the Arts, in Oakland, and has directed North Indian music ensembles at the California Institute of the Arts’ Community Arts Partnership.\n\nWilliam's interests in world music have led him to study the music of Indonesia, Uganda, Tanzania, Ghana, and many others. He spent half a year in a remote village in northern Bali, conducting field research and training under master musicians I Made Terip and I Putu Putrawan and was a member of Sekar Jaya, a world-renowned Gamelan ensemble, playing in their Gong Kebyar, Anklung, Joged and Jegog ensembles. Other musicians William has studied under include Randy Gloss, I Nyoman Wenten, Andrew Grueschow, Houman Pourmehdi, Alfred Ladzekpo, Damascus Kafumbe, Dr. Michael Bakan and Dr. Frank Gunderson.\n\nAdditionally, William directs music workshops for students with autism and other developmental differences through Youth In Arts, a leading arts education non-profit organization.\n\nWilliam is the inventor of the Tihai Clock, a mechanical means of completely representing the many rhythmic cadences of Hindustani music, known as tihai. He lives in San Anselmo, California where he teaches Tabla privately.",
      "note": "",
      "series": "JCA World Music Festival",
      "price": "$25 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-10-21",
        "end": "2022-10-21"
      },
      "location": "",
      "image": "arjun-verma-w-william-rossel.jpg",
      "image_width": "800",
      "image_height": "569",
      "stream": "",
      "youtube": "MIII8Utzl-w",
      "youtube2": "gMRZs0NOvMY",
      "youtube3": "-biAkaKIqtw",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_slug": "jca-world-music-festival-all-access-pass--sep-24-to-oct-21-2022"
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "tony-mcmanus-legendary-celtic-guitarist--sep-13-2022",
      "title": "Tony McManus - legendary Celtic guitarist",
      "performer": "Tony McManus",
      "description": "Hailed by John Renbourn as ’the best Celtic guitarist in the world’ Tony McManus will grace the JCA Stage Tuesday evening Sept 13th at 8pm",
      "details": "“Tonys music is beyond beautiful… its perfect” ~Tommy Emmanuel\n\n[Tony McManus](https://tonymcmanus.com) has also been listed as one of the 50 transcendent guitarists of all time by Guitar Player Magazine. Tony has both extended and transcended the parameters of contemporary Celtic music. Ranked by peers and predecessors alike alongside the guitar world’s all-time greats, his fiendishly dexterous, dazzlingly original playing draws on traditions from the entire Celtic world, along with still further-ranging flavours such as jazz and eastern European music. Long applauded for his uncanny ability to transpose the delicate, complex ornamentation characteristic of traditional bagpipe or fiddle tunes – even the phrasing of a Gaelic song – onto his own six strings, McManus is increasingly being acknowledged also as a pioneering figure in bridging the realms of Celtic music and other guitar genres.\n\nBorn in 1965 in Paisley, near Glasgow, McManus was introduced to traditional music via the family record collection. Having first tried his hand at the fiddle, whistle and mandolin, he took up the guitar aged ten, although subsequent academic inclinations got him halfway through a PhD in maths before the music won out. After rapidly making his name as an unusually fluent and sensitive accompanist, he took the solo plunge with a triumphant main-stage debut on the final night of Glasgow’s inaugural Celtic Connections festival in 1994, supporting Capercaillie in front of a 2500-strong crowd.\n\nWith the loyal support of Greentrax Recordings in Scotland Tony’s first self-titled recording in 1996, followed by Pourquoi Quebec in 1999 led to worldwide recognition. However, it was with the release of Ceol More in 2002 that Tony’s stature as a first-class musician reached a new level. Having heard his session work on several albums, Nashville based Compass Records released “Ceol More” in North America to universally ecstatic reviews. Critics hailed the focused, spell-binding nature of the music, from the plaintive Jewish hymn “Shalom Aleichem” to the ingenious arrangement of the Charles Mingus tune “Goodbye Pork Pie Hat”. Having been nominated as Musician of the Year by both the BBC Folk Awards and The Scottish Traditional Music awards, in 2002 “Ceol More” hit the Critic’s Album of the year list in Acoustic Guitar magazine and was named Live Ireland Awards' Album of the Year.\n\nIn a relatively short time Tony’s music has come to define a new role for the guitar in Celtic music. He has come to represent Celtic music in the guitar world, making regular appearances at guitar specific f.festivals such as the Chet Atkins Festival in Nashville; the Ellnora Guitar Festival in one of Illinois's most prestigious venues, the Krannert Center, with the likes of Pat Metheny, Kaki King, Molly Tuttle, and Steve Dawson; has appeared at Guitar Festivals in Soave and Pescantina, Italy; Frankston, Australia; Issoudun, France; Kirkmichael, Scotland; Bath and Kent, England; Bochum and Osnabruck, Germanyand has taught at five of Steve Kaufman’s Acoustic Kamps in Maryville, Tennessee. He performed at the famous Ryman Auditorium in Nashville in the “All Star Guitar Night” featuring Steve Morse, Bryan Sutton, Muriel Anderson, Béla Fleck and Victor Wooten and headlined by the legendary Les Paul. His ability to reach audiences unfamiliar with traditional music is remarkable - he is quite comfortable at predominantly classical events such as the Dundee and Derry Guitar Festivals (appearing six times between the two) and even The Bogotá International Guitar Festival where he followed virtuoso Eduardo Fernandez. He is also a signature artist for PRS Guitars in Maryland, and has performed at their venue with Carlos Santana, among others. These days Tony has a busy tour schedule, but he also authors books on Celtic guitar, and is in demand for workshops and lessons.",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue, $25 adv online →\nStudents/Seniors $25 at venue, $20 adv online →\nKids 12 and under FREE →",
      "price_note": "",
      "ticket": "408257859247",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-09-13",
        "end": "2022-09-13"
      },
      "location": "",
      "image": "tony-mcmanus.jpg",
      "image_width": "800",
      "image_height": "534",
      "stream": "",
      "youtube": "ID9GWTDFUoI",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "blu-egyptian--aug-25-2022",
      "title": "Blü Egyptian Outdoor Show",
      "performer": "Blü Egyptian",
      "description": "Blü Egyptian …Chico based funk world bluegrass band is coming to Mount Shasta play the JCA field on August 25th!",
      "details": "Grab your dancing shoes and come out to the JCA field on Thursday evening August 25th Tickets $10 advance $15 at the gate. JCA Bar on site bring a chair a blanket. Picnics are welcome. Dancing is vital! Gates open at 6:30. See you there!\n\n[Blü Egyptian](https://www.bluegyptianband.com/) from Chico, Ca, play original music encompassing bluegrass, rock, funk, latin and reggae for the ultimate dance party!\n\nFormed in 2020, Blü Egyptian are friends who met in the recording arts classes in high school and then became a band when the school closed during the pandemic. During that time, they streamed live on Twitch and released a 4-song EP in January 2021. They released their first full length s/t album “Blü Egyptian” in June 2021 and have been touring throughout Northern California since. The new album “Dame Un Segundo” was released in May 2022. They have been touring throughout Northern California this summer playing at many festivals including High Sierra Music Festival, Hogfarm Hideaway, Feather River Flowdown, Owlfest X and California Worldfest.",
      "note": "Gates open at 6:30",
      "series": "",
      "price": "$15 at venue / $10 adv online →",
      "price_note": "",
      "ticket": "399648979857",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-08-25",
        "end": "2022-08-25"
      },
      "location": "",
      "image": "blu-egyptian.jpg",
      "image_width": "720",
      "image_height": "720",
      "stream": "",
      "youtube": "X7xuqJDR95c",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": true,
        "is_excluded": true
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "alice-in-wonderland--aug-05-2022",
      "title": "Alice In Wonderland",
      "performer": "Mt Shasta Childrens Theatre",
      "description": "Mt Shasta Childrens Theatre presents ALICE IN WONDERLAND, the 9th Annual Broadway Camp Musical Performance.",
      "details": "This brand-new musical version of the timeless classic takes you down the rabbit hole with the ever-curious Alice to a land of zany adventures where nothing is as it seems. The White Rabbit, Tweedle-Dee and Tweedle-Dum, the Mad Hatter, the Caterpillar, the Mock Turtle, the mysterious Cheshire Cat, the Queen of Hearts, and all your favorites from Lewis Carroll’s beloved books make this a magical, tuneful, and over-the-top entertaining musical for the whole family!",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue, $15 adv online →\nStudents/Seniors $15 at venue, $10 adv online →\nKids 8 and under FREE →",
      "price_note": "",
      "ticket": "382655993377",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-05",
        "end": "2022-08-05"
      },
      "location": "",
      "image": "alice-in-wonderland.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "slug": "alice-in-wonderland-matinee--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-07-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-07",
        "end": "2022-08-07"
      }
    },
    {
      "category": "music",
      "type": "dance party",
      "slug": "catch-rabbit-sprig--jul-28-2022",
      "title": "Catch Rabbit & Sprig",
      "performer": "Catch Rabbit, Sprig",
      "description": "A FREE outdoors dance party for all ages. Seattle based Catch Rabbit is a psychedelic art-pop project. Sprig opens. An evening of unique and pleasurable musical theatrics.",
      "details": "**CATCH RABBIT**\n\nis the faint aroma of cotton candy in a swirling circus of pleasure. Catch Rabbit is the moment you wake up, when the dream world barges into the real world only to vanish in a puff of glitter. Catch Rabbit is your butt—your personal, literal butt—vibing rhythmically to the symphony of your feelings.\n\nTheir self-titled debut cassette is out now on Den Tapes. Buy the tape to hear Better Angels, Nobody Really Knows and Autumnesque, plus 5 more unheard tracks!\n\n“Would sound real good blasting from a car radio as you do a little Summertime cruise on Alki Beach” - DJ nstop, Hollow Earth Radio\n\n“Recommended for living in a kaleidoscope” - The Tape Deck\n\n\n**SPRIG**\n\nBe The Queercoded Villain You Wanted to Date as a Child.\n\nIt's campy synthy buttrock for girls TM\n\nChristiana is a dumbass ecogoth who writes the songs and does keytar.\n\nDrew Shreve is a powerful drum slut with a growing synth kink.\n\nSara does Viola! She does guitar! She does weird things to my feet!\n\nWatch Out\n\nDrea is our vers goddess of bass, synths, keys, percussion and KINDNESS",
      "note": "",
      "series": "",
      "price": "free admission",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-28",
        "end": "2022-07-28"
      },
      "location": "",
      "image": "catch-rabbit-sprig.jpg",
      "image_width": "700",
      "image_height": "400",
      "stream": "",
      "youtube": "bVDriykl9Ds",
      "youtube2": "9bCjY8VNtAo",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "pato-banton-reggae-show-outdoors--jul-19-2022",
      "title": "Pato Banton reggae show outdoors",
      "performer": "Pato Banton",
      "description": "Reggae Legend Pato Banton Live in Mt Shasta for an Outdoor Show.",
      "details": "[Pato Banton](https://officialpatobanton.com/) is a grammy nominated reggae legend that has recorded and toured the world with The English Beat, Steel Pulse, UB40 & STING! (just to name a few) . During the year 2000, while in the midst of a global trek with Peter Gabriel’s WOMAD organization, that combined huge festivals with music outreach programs to poor and underprivileged communities, Pato learned that two of his sons had been shot in a drive-by shooting! He immediately put his career on hold and turned his sorrow into the impetus for community & educational initiatives that would consume the next six years of his life.\n\nPato created an organization called “Musical Connections” and in partnership the Community Safety Team, provided tuition and counseling for “at risk” young people in 16 different communities across his city of Birmingham, UK. This project was so successful that Pato was approached by the West Midlands Police Department to tackle the ongoing problem of gun crime in some of the poorest neighborhoods. Within a few years this partnership greatly reduced gun crime across the entire city and Pato was given a Lifetime Achievement Award by the BBC and entered into the British Music Hall of Fame during the same year.\n\nIn 2006, after feeling that he had planted enough seeds of progress within his home community, Pato decided to relocate to Southern California and embark on the second phase of his musical journey, taking with him the years of experience in the field of Loving Service. Since then Pato has recorded many albums and collaborated with artists all over the world. His most recent albums Love Is The Greatest & The Words Of Rastafari were released on Bob Marley’s Tuff Gong Records International.\n\nPato Banton’s four-decade public presence has increasingly transcended music to convey a positive & uplifting message of global peace and love for humanity. Now based in Southern California, he continues to record and tour the world extensively with his band The Now Generation, while simultaneously serving as a Teacher, Minister, Counselor and Mentor to his Fans, Friends & Family worldwide!",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "377510362657",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-19",
        "end": "2022-07-19"
      },
      "location": "",
      "image": "pato-banton.jpg",
      "image_width": "800",
      "image_height": "533",
      "stream": "",
      "youtube": "2qG5PlhdCMU",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "summit",
      "type": "gathering",
      "slug": "mt-shasta-star-knowledge-peace-summit--aug-12-15-2022",
      "title": "Mt. Shasta Star Knowledge Peace Summit",
      "performer": "",
      "description": "Three days of Wisdom Keepers, Music & Dance. We/You, are all Sacred Beings. Let’s Unite in Prayer & Peace to help change the Planet.\nEarly bird special until 7/7/22 at 7:00PM.",
      "details": "Do you hear the calling to Mount Shasta? We would love for you to join us.\n\nMount Shasta is a sacred place, a dimensional Doorway to the frequency of Love, let us join together to open our hearts to pure love and Bliss.\n\nShasta is a mirror that shows us the purity of who we truly are are.\n\n\nAll Nations - All Races - All Our Relations\n\n\n**Speakers**\n\nAlway our in Spirit Leader Chief Golden Light Eagle Loren Zephier.\n\nTerri (Sings with Ravens) Rivera\n\nCarla Poluha\n\nFumi Johns Stewart\n\n**Co-Host** Dr. Arthur Robert Cushman (Tata Arturo) (Arturo Luminoso Ketzal Tlanetzia)\n\nJose Federico Munoz\n\nNikki Zephier South Dakota Daughter of Chief Golden Light Eagle\n\nBlue Hail Matthew D Campbell Jr. Head Singer Star Knowledge Drum\n\nHead Dancer Tata Cuco Murillo from Tecate, Baja California (tentative)\n\nLuis Antonio Fernandez Razo\n\nWash Chimalli ( Nahuatl)\n\nMexika Wisdom Keeper From Meshico Tenochtitlan ( Mexico 🇲🇽 City)\n\nDanza Ameyaltzin Yolihuani\n\nAunty Pooki Lee\n\nLeza Vivio\n\nBishop Darrell Nichols\n\nGeri LittleJohn\n\nMartha Elena Sáenz\n\nLauraSa Pele Lafoia Ava\n\nClaudia Tomasiewicz\n\nJen Noel\n\nBill Homann & The Mitchell-Hedges Crystal Skull\n\nFULL DETAILS on [eventbrite ticket website](https://www.eventbrite.com/e/mt-shasta-star-knowledge-peace-summit-immersion-tickets-159043905603)",
      "note": "",
      "series": "",
      "price": "$222 early bird special / $333 after July 7 →",
      "price_note": "Early bird special until 7/7/22 at 7:00PM",
      "ticket": "159043905603",
      "time":{
        "start": "09:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-08-12",
        "end": "2022-08-15"
      },
      "location": "",
      "image": "star-knowledge-peace-summit.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "comedy-night-jun-18-2022",
      "title": "Comedy Night at the JCA",
      "performer": "Shannon Battle, Jen Jay, Nick Meier",
      "description": "JCA Presents COMEDY NIGHT with headliner Shannon Battle. Featuring Jen Jay, Hosted by Nick Meier.",
      "details": "Three hilarious comics coming to Mt Shasta\n\n[Shannon “Funny” Battle](https://www.instagram.com/shannon_battle_funny/)\n\nJen Jay - 2nd place winner of Eugene, Oregons Funniest People 2021\n\nNick Meier - A sexually charged human sized hard-boiled egg of a comedian.",
      "note": "",
      "series": "Comedy Night",
      "price": "$20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "359777081937",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-06-18",
        "end": "2022-06-18"
      },
      "location": "",
      "image": "comedy-night-20220618.jpg",
      "image_width": "750",
      "image_height": "950",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    }
  ]
}