{
  "schema":
  {
    "category": "music|visual-arts|theater|fest|festival|summit|comedy|open-mic|movie",
    "type": "performance|class|workshop|lecture|exhibition|benefit|gathering|presentation",
    "slug": "dashed-title--mmm-dd-2025",
    "title": "",
    "performer": "",
    "description": "",
    "details": "#header# info",
    "note": "",
    "series": "",
    "price": "General Admission $30 at venue / $25 adv online →\nStudent/Senior $20 at venue / $15 adv online →\nKids 8 and under FREE →",
    "price_note": "",
    "ticket": "",
    "humanitix": "",
    "time":{
      "start": "hh:mm",
      "end": ""
    },
    "date":{
      "start": "2025-mm-dd",
      "end": "2025-mm-dd"
    },
    "location": "",
    "image": "",
    "image_width": "800",
    "image_height": "600",
    "stream": "",
    "youtube": "",
    "youtube2": "",
    "youtube3": "",
    "flag": {
      "show_registration_form": false,
      "is_outdoors": false,
      "is_postponed": false,
      "is_canceled": false,
      "is_excluded": false,
      "is_free": false
    },
    "stamp": "",
    "stamp_summary": "",
    "sponsor_text": "",
    "sponsor_image": "",
    "reference_slug": "",
    "all_access_pass": {
      "link": "",
      "expires": "",
      "text": "",
      "note": ""
    }
  },
  "events":[
    {
      "category": "music",
      "type": "performance",
      "slug": "test--mmm-dd-2023",
      "title": "TEST",
      "performer": "",
      "description": "TEST",
      "details": "TEST",
      "note": "",
      "series": "",
      "price": "General Admission $25 at venue / $20 adv online →\nStudent/Senior $20 at venue / $15 adv online →\nKids 8 and under FREE →",
      "price_note": "---Online ticket purchase link to be added soon---",
      "ticket": "",
      "humanitix": "",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2023-01-26",
        "end": "2023-01-26"
      },
      "location": "",
      "image": "",
      "image_width": "",
      "image_height": "",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": true,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "andrew-finn-magill--apr-29-2025",
      "title": "Andrew Finn Magill",
      "performer": "Andrew Finn Magill",
      "description": "Violin-led quartet reimaging the music of Ireland, Brazil and Malawi.",
      "details": "#Andrew Finn Magill# North Carolina violinist/fiddler [Andrew Finn Magill](https://andrewfinnmagill.com/) is a Fulbright Fellow, a South Arts Emerging Traditional Artist, a North Carolina Arts Council Fellow, an All- Ireland Fiddle finalist, and a Ropeadope Records recording artist. He has been featured on MTV-U, PBS, and multiple times on NPR. His 2016 album, *Roots*, debuted at number #46 on the folk DJ charts and he has released six albums since.\n\nHis newest recording, *The Polaris Project*, is an ambitious album of ten original pieces written for an electric jazz quartet which synthesize Magill’s years living and working as a musician in Ireland, Malawi, Ghana, Brazil and the Southern U.S. The band features world-class musicians Justin Stanton of the Grammy-winning Snarky Puppy, bassist Ethan Jodziewicz (Sierra Hull, Molly Tuttle) and drummer Justin Watt of the Glen Miller Orchestra, with special guests, Malawian music icon Peter Mawanga and Rising Appalachia’s Leah Song. The recording is sched- uled for a 2023 release.\n\nFinn has received acclaim from some of the foremost jazz violinists on the planet, including Downbeat’s No.1 Ris- ing Star of the violin, Christian Howes, Snarky Puppy’s Zach Brock, who says Magill displays “effortless virtuosity” and Berklee College’s Matt Glaser who calls him “an extraordinary violin virtuoso.”",
      "note": "",
      "series": "",
      "price": "General Admission $25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "andrew-finn-magill",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2025-04-29",
        "end": "2025-04-29"
      },
      "location": "",
      "image": "andrew-finn-magill.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "mKJz1qb0hWc",
      "youtube2": "UObY913FuqQ",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "tadaima-in-concert--apr-25-2025",
      "title": "Tadaima - In Concert",
      "performer": "Tadaima",
      "description": "Russel Baba and Jeanne Mercer form TADAIMA’s “home” center with winds and taiko. Featuring the legendary taiko master Kenny Endo and the phenomenal bassist Gary Fitgerald. This weekend’s concerts will be live streamed across the world to celebrate TAIKO in North America. These artists are masters of their craft and Taiko Ventures is honored to be sharing their artistry with the world.",
      "details": "#Tadaima# A Historical Moment in North American Taiko!\n“Tadaima!” - “now, at present / I am here! / I am home!” - is a traditional Japanese announcement when one comes home.\nTADAIMA is a musical home for its artists.\nTADAIMA performs original music influenced by the traditions of jazz improvisation, world cultures, and modern music.\n\nRussel Baba and Jeanne Mercer form TADAIMA’s “home” center with winds and taiko. Featuring the legendary taiko master Kenny Endo and the phenomenal bassist Gary Fitgerald.\n\n#Kenny Endo# Kenny Endo is at the vanguard of the taiko genre, continually paving new paths for this Japanese style of drumming. A performer, composer, and teacher of taiko with numerous awards and accolades, Kenny Endo is a consummate artist, blending Japanese taiko with rhythms influenced from around the world into original melodies and improvisation.\n\nOriginally trained as a jazz musician in the Asian American cultural renaissance of 1970s California, Endo began his taiko career first with L.A.’s groundbreaking Kinnara Taiko, then with the renowned San Francisco Taiko Dojo, the first kumi daiko (ensemble drumming) group outside of Japan. In 1980, he embarked on a decade-long odyssey in his ancestral Japan, studying and performing with the masters of classical drumming, traditional Tokyo festival music, and ensemble drumming. Endo has the honor of being the first non-Japanese national to have received a natori (stage name and masters license) in hogaku hayashi (classical drumming). In the hogaku world, Endo is known as Mochizuki Tajiro.\n\nIn the greater musical world, “Kenny Endo” has become synonymous with “taiko.” He is arguably one of the most versatile musicians in the genre, crossing easily between the classical Japanese style and his own neo-traditional, globally-inspired variety. Among his many distinctions are an M.A. in Ethnomusicology from the University of Hawaii at Manoa, an artist residency at the Lincoln Center Institute in New York, his own “Kenny Endo Day” proclaimed by the Mayor of Honolulu, and certificates of honor from the Hawaii State House of Representatives, State Senate, and the Honolulu City Council.\n\nEndo has performed to critical acclaim with Tsugaru shamisen artist Hiromitsu Agatsuma in New York and Honolulu, and served as an ambassador of Japanese culture and the arts via Japan Foundation sponsored goodwill concerts and workshops in Costa Rica, the Bahamas, Jamaica, Belize, El Salvador, and Nicaragua. He also collaborated with professional Kabuki musician Saburo Mochizuki and Tokyo taiko soloist Yuu Ishizuka in Honolulu’s “Classical and Contemporary Taiko Drumming” concert. Endo was a featured artist in Japan’s “Nihon no Taiko” concert in Tokyo, the first time foreigners ever headlined the prestigious concert.  Comfortable collaborating with artists of all genre, Endo continues to tread new ground for this ancient instrument, inspiring all with his creativity, technique, and infectious groove.\n\nEndo has recorded numerous CDs of original taiko compositions, and was a featured artist on the PBS special “Spirit of Taiko.” He has performed for musicians Michael Jackson, Prince, as well as Prince Charles and the late Princess Diana.  He opened for The Who, performed a duet with singer Bobby McFerrin, and is featured on the soundtracks for Kayo Hatta’s film “Picture Bride,” Francis Ford Coppola’s “Apocalypse Now,” recorded in motion capture suit for James Cameron’s “Avatar,” as well as numerous TV commercials. Endo’s taiko skills have taken him to the Microsoft Global Meeting in Atlanta, the Smithsonian, the National Museum of American History, the Kennedy Center in Washington D.C., the Lincoln Center in NYC, the Theatre de Champs-Elysee in Paris, the Kabukiza, and the Japan National Theater. He has performed as a soloist with the Hong Kong Philharmonic, the Honolulu Symphony, the Stanford Symphony, the Tokyo Symphony, and the Brazilian Orquestra Experimental.  He has traveled across Asia, Africa, Europe, Oceania, the former Soviet Union, Australia, and the Americas in his effort to share taiko with the world.\n\nEndo has received commissions to create and tour new work from the American Composers Forum, the McKnight Foundation, Continental Harmony, The Children’s Theater Company, the Rockefeller Foundation (MAPP), the Japan Foundation, the Freeman Foundation, Hawai`i State Foundation on Culture and the Arts, the Japanese American Cultural and Community Center, Stanford Lively Arts, and the Honolulu Mayor’s Office of Culture and the Arts.\n\n“Island Breeze,” a trio featuring Endo, Grammy award winning Jeff Peterson (Hawaiian Slack Key Guitar) and Riley Lee (shakuhachi) was nominated for Na Hoku Hanohano awards (Hawaii’s version of the Grammys) for “Album of the Year” and “Na Pali” for “Instrumental Song of the Year” in 2015. Endo joined forces with front-ranking tabla player Abhijit Banerjee, and five-time Grammy nominee John Santos in recording “Uncommon Time: Taiko, Tabla, and Timbales,” a CD released in 2016.\n\nKenny Endo is honored to perform on taiko, provided courtesy of Miyamoto Unosuke Shoten.\n\n#Russel Baba#“…a strong Japanese American jazz musician who in playing his own compositions is playing himself…projects a fierce, uncompromising integrity.”\n~ Richard Oyama, DownBeat Magazine\n\n“Russel Baba has managed to endow his alto saxophone with the timbre and flexibility of a violin.  His new sound is extra-ordinarily beautiful…”\n~ Elaine Cohen; CODA Magazine\n\nMusic has always been present, but acknowledging the innate gift and talent came later when Russel developed a passion for flutes and saxophone.  Self-taught, a personal sound emerged and an openness and creativity were discovered in himself.\n\nHe was blessed to work and tour with legendary jazz artists - drummer Eddie Moore, violinist Michael White, and pianist Andrew Hill, literally learning to play and develop while performing live on stage with them.  Their encouragement, belief, support, generosity, and friendship deepened an understanding in his musical path, widened horizons, and bestowed a legacy of creativity, originality, and spontaneity.\n\nTaiko and Gagaku provided an opportunity to explore and develop an appreciation for his Japanese heritage through its music.  He started with Grand Master Seiichi Tanaka and San Francisco Taiko Dojo, studied Gagaku with Suenobu Togi, and later founded Shasta Taiko and ShastaYama in rural California’s Mount Shasta with fellow taiko artist and life partner Jeanne Mercer.\n\nBeing a jazz improviser and taiko artist is already an odd balance of duality that may be a reflection on living today in two or more worlds – tradition/modern, form/freedom, mind/heart, east/west.\n\nAs a saxophonist, he never imagined that he’d be involved not only with taiko, but with establishing and developing a successful annual outdoor taiko and music festival at the base of majestic Mount Shasta.  Named ShastaYama, the festival’s visions are to create a quality platform to feature a wide variety of musicians and taiko artists by encouraging original works while honoring the traditions.\n\nThe musical ensemble TADAIMA, is a continuation on the creative path encouraged and inspired by mentors and fellow artists.  TADAIMA features original compositions in the improvisational music tradition.\n\n“Baba is an exceptionally forceful player.  Even on the bamboo flute his work has a hard, shrill quality that communicates intensely.”\n~ J. N. Thomas, Ear Magazine\n\n“The reference to ‘the Zen of the saxophone’ applies to Russel’s music…powerful emotions present…strong conceptual elements…contained through a sense of embodiment…very open and spiritual.”\n~ Brian Auerbach, Option Magazine\n\n#Jeanne Aiko Mercer#Jeanne Aiko Mercer is a recognized and honored American taiko pioneer.  She has inspired a new generation of taiko artists.  Jeanne trained and toured with San Francisco Taiko Dojo under Grand Master Seiichi Tanaka and established Shasta Taiko and the ShastaYama Festival with Russel Baba.\n\nJeanne has taken taiko to new areas performing and recording jazz influenced music and improvisation as well as writing original compositions for taiko and jazz.  Her taiko compositions are the center of Shasta Taiko’s repertoire and are considered “classic” in modern American taiko.\n\nShe leads workshops with Russel Baba at national, regional, and collegiate conferences in taiko and improvisation.\n\nMercer has collaborated and performed original work with Russel Baba and jazz artists - Eddie Moore, Michael White, Andrew Hill, Gary Fitzgerald, Mark Izu, Makoto Horiuchi,; taiko artists - Seiichi Tanaka, Kenny Endo, Masato Baba, San Jose Taiko, Portland Taiko, and On Ensemble; Japanese butoh dancer Koichi Tamano; writer Lawson Inada; and painter Hisako Hibi.\n\nShe has contributed to movie soundtracks – Star Wars and Apocalypse Now, and is featured on recordings by Russel Baba  – Hisashi, Spirit Drum, Tadaima, and Korewakorewa.\n\n#Gary Fitzgerald# Gary Fitzgerald is known for his dynamic bass sound, creative spontaneity, and a unique writing approach.\n\nGary has been a bassist for a few decades. He learned to play electric bass first and then graduated to standup bass. He plays all types of music from Afro to Zydeco. His influences include the likes of Charles Mingus, Ray Brown, Ron Carter, Charlie Hayden, Jaco Pastorius, and many others. He has worked with E. W. Wainwright, Eddie Moore, Michael White, Eddie Henderson, Lou Rawls, Ray Brown, Jr. to name a few. Gary is always looking for new ways to express how the bass can be used to lift music to creative new levels and still hold down the groove.\n\nGary has performed and recorded original music with jazz artists - wnd player Russel Baba, drummer Eddie Moore, violinist Michael White, drummer E. W. Wainwright, and pianist Ron Hart.  He has also performed with trumpeter Eddie Henderson and guitarist Bill deArango.  Fitzgerald has toured and recorded with Eddie Moore’s Space Shuttle Omnibus and E.W. Wainwright’s Afro Roots of Jazz.  He currently performs music with several Los Angeles based ensembles.",
      "note": "This is the first of three shows this weekend",
      "series": "Tadaima & Shasta Taiko weekend",
      "price": "General Admission $25 at venue / $20 adv online →",
      "price_note": "All three shows: $50 adv online.",
      "ticket": "",
      "humanitix": "tadaima-in-concert",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2025-04-25",
        "end": "2025-04-25"
      },
      "location": "",
      "image": "tadaima-in-concert.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "dndHJR_Wm0c",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "slug": "tadaima-in-concert--apr-26-2025",
      "reference_slug": "tadaima-in-concert--apr-25-2025",
      "note": "This is the second of three shows this weekend",
      "date":{
        "start": "2025-04-26",
        "end": "2025-04-26"
      }
    },
    {
      "slug": "tadaima-in-concert--apr-27-2025",
      "reference_slug": "tadaima-in-concert--apr-25-2025",
      "note": "This is the last of three shows this weekend",
      "time":{
        "start": "15:00",
        "end": "17:00"
      },
      "date":{
        "start": "2025-04-27",
        "end": "2025-04-27"
      }
    },
    {
      "category": "comedy",
      "type": "performance",
      "slug": "jca-comedy-night--apr-4-2025",
      "title": "JCA Comedy Night - April 4th",
      "performer": "Pete Nelson, Franco Tevini, Alice Lopez, Leah Tamara",
      "description": "JCA Presents COMEDY NIGHT with Franco Tevini, Alice Lopez and Leah Tamara, hosted by Pete Nelson.",
      "details": "**Alice Lopez** is an up and coming comic based in Sonoma County, who’s been turning heads in her recent time on the scene. Her jokes are as clever as a GPS asking you to make a left turn, but uncharted territory is where you’re headed. Her realistic, dry playful charm will keep you guessing what she’ll say next.\n\nWith a decade of experience, **Franco Tevini** has made a name for himself performing digestible bits of surreal, elevated slice-of-life comedy. A lifelong theater actor and improv comic, Franco’s character work and knack for storytelling has endeared his stand-up to audiences near and far. He has featured on shows all across the West Coast and beyond at such venues as Cobb’s Comedy Club, The Comedy Spot Sacramento, and The New York Comedy Club\n\n**Leah Tamara** is a Humboldt County Comedian that is sure to capture your heart and attention. Her writing translates to the stage in the funniest ways and you'll be convinced she's going to be famous some day. She has great clean and blue comedy. Stick around for her but then be sure to get others to know about her!\n\n**Pete Nelson** has a lot of dad jokes, one liners, and puns. You'll be left wondering how some of his ideas were conceived as they are just so nutty you'll wonder what he's on. Pete has been featured in the Wall Street Journal, he produces multiple comedy festivals, and he's been doing comedy for around ten years.",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "jca-comedy-night-april-4th",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2025-04-04",
        "end": "2025-04-04"
      },
      "location": "",
      "image": "jca-comedy-night-20250404.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "the-hattie-and-joe-show--mar-29-2025",
      "title": "The Hattie & Joe Show - Concert",
      "performer": "Hattie & Joe Craven",
      "description": "It's a rootsy, jazzy, poppy, bluesy, worldly, folkie musical terrain covering lots of ground with twists and turns at every mile marker. It's originals and reimagined music spanning the last 100 years and it's all delivered to your musical doorstep by stunning 24 year old vocalist Hattie Craven and her award winning multi-instrumentalist, improvologist-wingnut father Joe Craven.",
      "details": "#Hattie & Joe# Hatty & Joe are vocalist Hattie Craven and her award winning multi-instrumentalist, improvologist-wingnut father Joe Craven. This family affair has created a celebration of music making by finding common ground between different generations with differing musical tastes and sensibilities. They curate their art, family style, while awakening themselves, and us, to new possibilities as the Cravens bring their love of music to a multi-generational table and audience. They have presented to schools and library programs, house concerts, clubs, theaters and nationally known music festivals.\n\n**Hattie**, in addition to being a seasoned actor in community theater, has built a reputation as one of the finest young, if not youngest, performers on the stages of numerous nationally noted music festivals from coast to coast… and all to standing ovations.\n\n**Joe** is a creativity educator, former museum curator, camp director, poet/storyteller, fashion insultant, coast to coast music festival emcee (notably Delfest, Telluride Bluegrass, Live Oak & Grand Targhee) and recipient of the 2009 Folk Alliance Far-West Performer of the Year. He’s made music with many things and many folks – from Grateful Dead guitarist Jerry Garcia, whirled artist David Lindley and harmonica wizard Howard Levy, to 7 years with banjo fusionist Alison Brown and 17 years with mandolinist David Grisman.\n\nHattie’s singing and sparkling presence for young hearted people of all ages on and off the stage, along with her father’s good humor and instrumental prowess on a variety of conventional and odd ball instruments make this a captivating and memorable show. ",
      "note": "",
      "series": "Joe Craven Weekend",
      "price": "General Admission $30 at venue / $20 adv online →",
      "price_note": "Adv online: Concert and both workshops $60 per person. Concert and One workshop $50 per person. Concert only $20.",
      "ticket": "",
      "humanitix": "joe-craven-weekend-concert-and-workshop-tix",
      "time":{
        "start": "19:30",
        "end": ""
      },
      "date":{
        "start": "2025-03-29",
        "end": "2025-03-29"
      },
      "location": "",
      "image": "hattie-and-joe-craven-2.jpg",
      "image_width": "800",
      "image_height": "800",
      "stream": "",
      "youtube": "QwyjP-2Uinw",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "slug": "joe-craven-songetry-workshop--mar-29-2025",
      "reference_slug": "the-hattie-and-joe-show--mar-29-2025",
      "title": "Joe Craven's “Songetry; Poem to Song” - Workshop",
      "price": "General Admission $40 at venue / $30 adv online →",
      "description": "A song writing workshop with Joe Craven.",
      "details": "Join us for an E-ticket ride upon the pursuit of possibility. You’ll be asked to write a poem to share, jumpstarting a song in 5 minutes! The goal is learning how to write in timed creative movement and spontaneity - while your inner critic is tucked away in the trunk! You won't be able to prepare for what we'll be creating, so just get ready to have fun and be surprised with what you and your friends’ ideas create under pressure. Joe will give you a recipe on how to cradle these poetic puppies in a variety of musical landscapes to explore and connect the intention of words to music.\n\nJoe’s “Songetry” connects something most of us have already done (writing a poem). Joe will then provide a template with ideas to move it to song. As many of us know, poems, whether rhyming or not, can tell a story in an accessible form of metered rhythm. We all possess the ability to write such stories and that is the grist for the mill of songwriting. This can bring surprising and often magical kick starts to new compositions to finish at home. Have a notebook and pen or, if you’re proficient at typing, your keyboard or smart phone will do.\n\n**Joe** is a creativity educator, former museum curator, camp director, poet/storyteller, fashion insultant, coast to coast music festival emcee (notably Delfest, Telluride Bluegrass, Live Oak & Grand Targhee) and recipient of the 2009 Folk Alliance Far-West Performer of the Year. He’s made music with many things and many folks – from Grateful Dead guitarist Jerry Garcia, whirled artist David Lindley and harmonica wizard Howard Levy, to 7 years with banjo fusionist Alison Brown and 17 years with mandolinist David Grisman.\n\n**Hattie**, in addition to being a seasoned actor in community theater, has built a reputation as one of the finest young, if not youngest, performers on the stages of numerous nationally noted music festivals from coast to coast… and all to standing ovations.",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2025-03-29",
        "end": "2025-03-29"
      }
    },
    {
      "slug": "hattie-and-joe-everybody-sings-workshop--mar-30-2025",
      "reference_slug": "the-hattie-and-joe-show--mar-29-2025",
      "title": "Singing Joyfully, Soulfully and Spontaneously! with Hattie & Joe Craven - Workshop",
      "price": "General Admission $40 at venue / $30 adv online →",
      "description": "A singing workshop with Hattie & Joe Craven.",
      "details": "Your voice is the most portable, versatile, amazing musical instrument you'll never buy! ANYONE can do creative things with their voice when the right person is there to show them and thousands of people can tell you that Joe Craven is one of those people! He will awaken your voice to new possibilities quickly and in very fun ways so you can find greater confidence in music making and add greater expression to your singing of a song or scatting melodies right in the moment. Show up “empty handed and open minded” as Joe and his daughter Hattie will help release your creativity in a super supportive way. They will deepen our connection to spontaneity, movement and seeing the value of not being attached to the outcome when letting your creative juices flow. This is not an ability-based class; anyone can do what the Cravens will bring to this workshop! They connect creativity to what you already do and moves you forward from there. You’ll think differently about sound, fearlessness, and yourself!\n\n**Joe** is a creativity educator, former museum curator, camp director, poet/storyteller, fashion insultant, coast to coast music festival emcee (notably Delfest, Telluride Bluegrass, Live Oak & Grand Targhee) and recipient of the 2009 Folk Alliance Far-West Performer of the Year. He’s made music with many things and many folks – from Grateful Dead guitarist Jerry Garcia, whirled artist David Lindley and harmonica wizard Howard Levy, to 7 years with banjo fusionist Alison Brown and 17 years with mandolinist David Grisman.\n\n**Hattie**, in addition to being a seasoned actor in community theater, has built a reputation as one of the finest young, if not youngest, performers on the stages of numerous nationally noted music festivals from coast to coast… and all to standing ovations.",
      "time":{
        "start": "16:00",
        "end": "17:30"
      },
      "date":{
        "start": "2025-03-30",
        "end": "2025-03-30"
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "eptas-seven-piece-jazz-ensemble-with-special-guests-wendy-james-and-dave-reynolds--apr-5-2025",
      "title": "Eptás - Seven Piece Jazz Ensemble with special guests Wendy James & Dave Reynolds",
      "performer": "Eptás, Wendy James, Dave Reynolds",
      "description": "Jazz Night with Eptás, a dynamic seven-piece jazz ensemble, with special guests Wendy James & Dave Reynolds.",
      "details": "#Eptás# [Eptás](https://itermusic.com/eptas/) is a dynamic seven-piece ensemble made up of four horns, piano, bass, and drums offering your listening audience a broad range of music and sound. This group brings together some of the finest players in the Rogue Valley including *Joe Balestreri* (trumpet), *Bob Rawlings* (tenor sax), *Chris Pearson* (baritone sax), *John Mazzei* (keyboards), *Tarik Ragab* (bass), and *Eric Pollard* (drums). Led by trumpeter/composer/arranger *Peter Anastos*, the band tackles challenging material, elevates the bar, and performs with precision which translates to an enjoyable experience for the audience.\n\nEmmy award winning Broadway performer *Wendy James* opens the show with local legend *Dave Reynolds* on piano.",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue / $25 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "eptas-seven-piece-jazz-ensemble-with-special-guests-wendy-james-and-dave-reynolds",
      "time":{
        "start": "20:00",
        "end": "22:15"
      },
      "date":{
        "start": "2025-04-05",
        "end": "2025-04-05"
      },
      "location": "",
      "image": "eptas.jpg",
      "image_width": "800",
      "image_height": "450",
      "stream": "",
      "youtube": "zwW0wbWxy1Y",
      "youtube2": "o11KrADWkj0",
      "youtube3": "gqnlO4ALysc",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "starwater-and-sol-sound-journey--may-3-2025",
      "title": "Starwater & Sol Sound Journey",
      "performer": "Starwater & Sol",
      "description": "Join Bodhi Starwater and Christopher Sol Parnell for a mesmerizing journey of sound.",
      "details": "Join *Bodhi Starwater* and *Christopher Sol Parnell* for a mesmerizing journey of sound – a harmonic attunement that soothes the body, mind and spirit guiding you to a timeless sanctuary of inner peace, connection and realignment with your true nature.\n\n(this will be a seated event)",
      "note": "",
      "series": "",
      "price": "General Admission $33 at venue / $27 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "starwater-and-sol-sound-journey",
      "time":{
        "start": "20:00",
        "end": "21:30"
      },
      "date":{
        "start": "2025-05-03",
        "end": "2025-05-03"
      },
      "location": "",
      "image": "starwater-and-sol-sound-journey.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "scottish-fish-high-energy-celtic-from-boston--apr-10-2025",
      "title": "Scottish Fish - High Energy Celtic from Boston",
      "performer": "Scottish Fish",
      "description": "Scottish Fish present a fresh take on traditional and contemporary Scottish and Cape Breton music.",
      "details": "#Scottish Fish# Described as “both very traditional and highly flexible” by Folkworld Magazine's Alex Monaghan, and as “one of the most energetic and creative acts to take root in the local Celtic music scene this century” by Boston Irish Reporter Sean Smith, [Scottish Fish](https://www.scottishfishfiddle.com/) present a fresh take on traditional and contemporary Scottish and Cape Breton music. After growing up steeped in the Boston Celtic music scene, these five young women began touring at an early age, quickly enchanting domestic and international audiences with their youthful enthusiasm, creative arrangements, and sensitive performances. As described by a concertgoer, “this powerhouse quintet wows listeners with a luscious and exciting sound, at times five instruments sharing one voice, and others a dynamic orchestra of harmony. Their years of friendship cultivate a truly unique musical bond. Their love for each other and the music they create is a gift they offer to anyone willing to listen.”\n\n“Both very traditional and highly flexible,” the Scottish Fish sound features “skillful fiddle melodies and harmonies, imaginative bass lines and rhythms, and spine-tingling treatments” of traditional tunes that render them into “modern masterpieces”\n~ Alex Monaghan, Folkworld Magazine (2023)\n\n“One of the most energetic and creative acts to take root in the local Celtic music scene this century… the Scottish Fish ensemble has made the transition from carrying the mantel of the ‘future of Celtic music’ to thoroughly occupying the present”\n~ Sean Smith, the Boston Irish Reporter (2023)\n\n[The Scottish Fish Sound is] “both incredibly musical and just a little unusual... individually they are all creative and talented, and together they spark each other, pushing each other even further to make amazing music”\n~ Hanneke Cassel, Scottish fiddler, as quoted in the Boston Irish Reporter (2018)",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue / $25 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "scottish-fish-high-energy-celtic-from-boston",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2025-04-10",
        "end": "2025-04-10"
      },
      "location": "",
      "image": "scottish-fish.jpg",
      "image_width": "800",
      "image_height": "533",
      "stream": "",
      "youtube": "G8ZFu_Gdbxs",
      "youtube2": "iPLsO_ePLMI",
      "youtube3": "A8lee_hFBM0",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "grassomoxoa-bluegrass-grateful-dead-spring-equinox-party--mar-21-2025",
      "title": "Grassomoxoa - Bluegrass Grateful Dead Spring Equinox Party",
      "performer": "Grassomoxoa",
      "description": "Grassomoxoa is four piece bluegrass band playing the music of the Grateful Dead and beyond. This is the Welcome Spring Equinox Party!",
      "details": "[Grassomoxoa on Facebook](https://www.facebook.com/grassomoxoa/)",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "grassomoxoa-bluegrass-grateful-dead-spring-equinox-party",
      "time":{
        "start": "20:00",
        "end": "23:00"
      },
      "date":{
        "start": "2025-03-21",
        "end": "2025-03-21"
      },
      "location": "",
      "image": "grassomoxoa.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "NqnPAllj5ko",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "kyran-daniel--mar-15-2025",
      "title": "Kyran Daniel - Encore Performance",
      "performer": "Kyran Daniel",
      "description": "Jefferson Center for the Arts is honored to welcome back Australian guitar virtuoso KYRAN DANIEL for an ENCORE PERFORMANCE after his stunning set at the JCA World Music Festival last fall. ",
      "details": "#Kyran Daniel# Guitarist, Composer, Producer and Musical Director, [Kyran Daniel](https://www.kyrandaniel.com/) began his career performing alongside Grammy Nominee Tommy Emmanuel on stages spanning the globe. His debut album ‘Per Se’ became a highly influential work in the acoustic guitar world, opening the door to his attendance of the prestigious Berklee College of Music studying under the greatest songwriting & production professors in contemporary music.\n\nFollowing his time at Berklee, Kyran focussed on the roles of songwriter & producer for a cohort of Australian artists including G Flip, Gretta Ray, and Kingswood. His diverse musical palette and superlative musicianship saw him fast become one of Australia’s finest studio talents, and a go-to for artists & labels domestically & abroad, his work garnering millions of worldwide streams, and credits including Gretta Ray’s ARIA Nominated Album ‘Begin To Look Around’ (EMI), and G Flip’s #1 ARIA Charting Album ‘Drummer’ (4x ARIA Nominated). Meanwhile his work on stage as Session Guitarist & Musical Director for the likes of Kingswood was presented on international tours and radio & television broadcasts across the globe.\n\n2022 saw Kyran return to his most authentic musical form as a solo artist, with a triumphant return to European and American stages alongside mentor Tommy Emmanuel, followed by a relentless tour schedule of solo concerts across Australia, Europe, and the USA, re-introducing him as one of the greatest solo guitar players on the planet. Kyran is currently completing his renaissance solo album entitled ‘Like The Night Itself’, drawing upon rich global influences, alchemised into emotive compositions, cinematic soundscapes, and virtuosic performances from the heart.\n\n\n‘I knew at that time he would be an incredible force in music…he was always received with thunderous applause and standing ovations…’\n~ Tommy Emmanuel AM\n‘likely the most influential acoustic guitar composer of his generation … publicly unsung, his pieces have shaped the progression of the art form since his emergence onto the world stage, only growing stronger through his dormancy … we’re excited to see what this master of the guitar presents in his renaissance’",
      "note": "",
      "series": "",
      "price": "General Admission $25 at venue / $20 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "kyran-daniel",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2025-03-15",
        "end": "2025-03-15"
      },
      "location": "",
      "image": "kyran-daniel.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "RKBGou4EQUQ",
      "youtube2": "0FCNVZIei1M",
      "youtube3": "rZtjLYKePZ4",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "whiskey-gulch-valentines-party--feb-14-2025",
      "title": "Whiskey Gulch - Valentines Party",
      "performer": "Whiskey Gulch",
      "description": "Fantastic local bluegrass band is a comin to the JCA for a special Valenines day concert. Bring your sweetie or yourself and your dancing shoes! This is gonna be FUN!",
      "details": "#Whiskey Gulch# With the quintessential bluegrass instrumentation of fiddle, banjo, mandolin, acoustic guitar, and upright bass, [Whiskey Gulch](https://www.facebook.com/people/Whiskey-Gulch/100063892338857/) delivers blistering instrumentals, highly crafted arrangements, and soul-shattering harmonies. California's northernmost bluegrass band is composed of five uniquely talented musicians, all with a common yearning for that perfect sound created by acoustic instruments and human voices. Hailing from the scattered faraway realms of Siskiyou County, each bandmate contributes a unique style and perspective to the group. Diverse musical backgrounds including jazz, classical, folk, and punk rock combine into the lively, fun, intricate and precise sound of Whiskey Gulch.\n\nButcher, baker, and banjo picker **Jake Stapley** has a mastery of many instruments and a deep background in jazz music as a pianist and drummer.\n**Sam Cuenca** (mandolin) is always the first to call if you need a sideman for a gig.  He excels at vocal harmonies and wild mandolin solos, and plays the most perfect bass lines.\n**Kevin Andras** (guitar) is known for wearing out his musical friends with marathon jams.  With tireless fingers and a deep catalog of songs to sing, he keeps it going 'til the sun comes up.\n**Tristan Behm** (bass), widely known for his Sundown Poaching, holds down the groove and contributes his fine voice to the “Pretty Boys” vocal section of the group.\n**Julie May** (fiddle) has been playing since she was a little kid, touring the country with the Fiddle Kids and competing in fiddle contests.  She brings to the group a deep understanding of rhythm and melody.",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "whiskey-gulch-valentines-party",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2025-02-14",
        "end": "2025-02-14"
      },
      "location": "",
      "image": "whiskey-gulch.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "IHmN2QAISRg",
      "youtube2": "nouGHIlAwxg",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "gordie-tentrees-and-jaxon-haldane--may-7-2025",
      "title": "Gordie Tentrees & Jaxon Haldane",
      "performer": "Gordie Tentrees, Jaxon Haldane",
      "description": "Gordie Tentrees has just returned from Nashville TN recording his new duo record with long time friend and musical cohort Jaxon Haldane.",
      "details": "#Gordie Tentrees & Jaxon Haldane# [Gordie & Jaxon](https://www.tentrees.ca/) recently recorded a new duo record in Nashville TN with Australian Nashville based acclaimed producer Nash Chambers (Paul Kelly, Kasey Chambers, Archie Roach) which featured Shawn Fichter (Drums) - Peter Frampton, Tim McGraw, Steve Mackey (Bass) - Dolly Parton, Wallflowers and special guests Trey Hensley (Grammy Nominee & IBMA Guitar player of the year) and Charlie McCoy (Harmonica) Elvis, Bob Dylan. It is set for release April 22- 2025 worldwide!\n\n“Organic & holistic folk, this is the wild sound of freedom and the freedom to fly”\n~ Midwest Record, USA\n\n2023 International Acoustic Music Award (IAMA) winners Gordie Tentrees (Yukon) and Jaxon Haldane (Manitoba) met in 2005 (Fred Eaglesmith Picnic, Ontario) and swapped records before hitting the road with disparate musical aspirations. Gordie performed over 3000 concerts around the world, often touring as Eaglesmith’s opening act, learning about the music business, and leveraging his previous experience in the boxing ring (3x Golden Glove champ). Tentrees also toured with James Cotten, Mary Gauthier, Kelly Joe Phelps, Steve Poltz, and Ray Wylie Hubbard, to name a few. Jaxon was meanwhile tearing up stages from Churchill to Belfast (D.Rangers bandleader/banjo player), producing records for his indie label (Dollartone), and touring with the likes of Petunia, The Sadies, Jon Spencer, and Romi Mayes. His close relationship with lifelong musical hero and mentor Willie P. Bennett led to Haldane recording Willie’s last record, Sharpen The Plow, just prior to Bennett’s passing in 2008. Haldane founded the Willie P. Bennett Legacy site to pay tribute to his deceased friend. Interestingly, Bennett and Eaglesmith spent 25 years performing and touring, setting an example of camaraderie and excellence that still guides the way for Tentrees and Haldane. ",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue / $25 adv online →\n",
      "price_note": "",
      "ticket": "",
      "humanitix": "gordie-tentrees-and-jaxon-haldane-82uuyakx",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2025-05-07",
        "end": "2025-05-07"
      },
      "location": "",
      "image": "gordie-tentrees-and-jaxon-haldane.jpg",
      "image_width": "800",
      "image_height": "600",
      "stream": "",
      "youtube": "vx8ZJ47ZgLI",
      "youtube2": "33c4e4jSwno",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "mark-hummel-blues-survivors-w-junior-watson--feb-01-2025",
      "title": "Mark Hummel's Blues Survivors w/ Junior Watson",
      "performer": "Mark Hummel's Blues Survivors, Junior Watson",
      "description": "Grammy Award Nominee and Winner of two Blues Music Awards, Mark Hummel started playing harmonica in 1970 and is considered one of the premier blues harmonica players of his generation.",
      "details": "#Mark Hummel's Blues Survivors# [Mark Hummel](https://www.markhummel.com/) started the Blues Survivors in 1976 with Mississippi Johnny Waters in Berkeley, CA. The band has changed personnel a few times since those early years but continues to be a straight up blues and roots outfit.\n\n*JR Watson* is the guitarist on Hummel’s True Believer(2024), Hard Lovin’ 90s( 1990), Lowdown To Uptown.\n\nPast band members have included Sue Foley, Rusty Zinn, Anthony Paule, Chris Masterson, Randy Bermudes & June Core (Charlie Musselwhite’s rhythm section), Bob Welsh (Elvin Bishop and The Fabulous Thunderbirds), Jimi Bott, Ronnie James Weber, Derrick “D’Mar” Martin (Rick Estrin and the Nightcats) as well as dozens more who started with Hummel. These days some of these same players continue to appear with Mark along with younger players like Pete Fazzini, Tony Delgado andr Niko Hernandez.\n\nThe Blues Survivors have been touring since 1984 across the US and the globe. Mark’s reputation of maintaining a first class band has made them one of the busiest bands on the planet, thanks to fiery harp blowing, guitar prowess and a wide ranging repertoire.\n\nMark is the recipient of two Blues Music Awards, a Grammy nomination and has thirty albums to his credit.\n\n\n“Hummel, a specialist in West Coast Blues, knows a thing or two about about how to please an audience”\n~ New Yorker\n\n“Hummel plays the harmonica with the fat, full sound that made Little Walter sound almost like a saxophonist rather than a harp man”\n~ Chicago Sun-Times\n\n“Mark Hummel is a Harmonica Virtuoso. He is one of a handful of the Best Players ever on the Instrument.”\n~ Blues Revue Magazine The Original Blues Survivors circa 1979",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue / $25 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "mark-hummel-blues-survivors-w-junior-watson",
      "time":{
        "start": "19:30",
        "end": "21:30"
      },
      "date":{
        "start": "2025-02-01",
        "end": "2025-02-01"
      },
      "location": "",
      "image": "mark-hummel.jpg",
      "image_width": "800",
      "image_height": "460",
      "stream": "",
      "youtube": "_Q9uuiQ8faA",
      "youtube2": "R-jJzg5_j14",
      "youtube3": "fad_PBusTv0",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "the-clements-brothers--jan-21-2025",
      "title": "The Clements Brothers",
      "performer": "The Clements Brothers, Mike Harmon",
      "description": "JCA is proud to welcome back The Clements Brothers! Last season, their amazing harmonies and musicality had Mt Shasta begging for more! So we are honored to welcome them back once again to the JCA. The Clements Brothers, George (guitar) and Charles (bass), combine their love of music in a rich blend of harmony and melody with original songwriting and instrumental skill.",
      "details": "#The Clements Brothers# [The Clements Brothers](https://www.theclementsbrothers.com/) are George and Charles Clements, identical twins from New England. They’ve been playing and writing music together for as long as they can remember and ‘The Clements Brothers’ marks their first project together since playing in the internationally touring grass-roots band, ‘The Lonely Heartstring Band’ with whom they put out two albums on Rounder Records. With roots, rock, bluegrass, jazz, and classical influences, George (on guitar) and Charles (on bass) aim to capture their singer-songwriter sensibilities in a unique blended voice, at once enthralling and intimate, groovy and serene. They are joined by drummer Mike Harmon, who joined the band after an impromptu late night set at the Ossipee Music festival, and adds his unique roots-conscious musicality to the group's evolving sound.  The trio is a fusion of each member's unique musical journey, and the result is music all its own, filled with vocal harmonies, instrumental virtuosity, and a genuine love of song.",
      "note": "",
      "series": "",
      "price": "General Admission $25 at venue / $20 adv online →\nStudents/Seniors $20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "",
      "humanitix": "the-clements-brothers-cqnhs5pd",
      "time":{
        "start": "20:00",
        "end": "22:00"
      },
      "date":{
        "start": "2025-01-21",
        "end": "2025-01-21"
      },
      "location": "",
      "image": "clements-brothers.jpg",
      "image_width": "800",
      "image_height": "800",
      "stream": "",
      "youtube": "tu5_eByt0-Y",
      "youtube2": "sUUPPm2Y-GU",
      "youtube3": "37ppJdcgQ44",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "christmas-crisis-in-mistletoe-mesa--dec-13-2024",
      "title": "Christmas Crisis in Mistletoe Mesa",
      "performer": "Mt Shasta Childrens Theatre",
      "description": "Mt Shasta Childrens Theatre presents “Christmas Crisis in Mistletoe Mesa”, a holiday melodrama for the whole family.",
      "details": "Drinks, Popcorn & Sweet Treats available at the show.\n\nAll proceeds directly benefit the Mt Shasta Childrens Theatre Scholarship Fund.",
      "note": "",
      "series": "",
      "price": "General Admission $15 at venue\nKids 12 and under FREE",
      "price_note": "Tickets are only available at the door starting 30 minutes before showtime",
      "ticket": "",
      "humanitix": "",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2024-12-13",
        "end": "2024-12-13"
      },
      "location": "",
      "image": "christmas-crisis-in-mistletoe-mesa.jpg",
      "image_width": "900",
      "image_height": "1600",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false,
        "is_excluded": false,
        "is_free": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": "",
      "all_access_pass": {
        "link": "",
        "expires": "",
        "text": "",
        "note": ""
      }
    },
    {
      "slug": "christmas-crisis-in-mistletoe-mesa--dec-14-2024",
      "reference_slug": "christmas-crisis-in-mistletoe-mesa--dec-13-2024",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2024-12-14",
        "end": "2024-12-14"
      }
    },
    {
      "slug": "christmas-crisis-in-mistletoe-mesa--dec-15-2024",
      "reference_slug": "christmas-crisis-in-mistletoe-mesa--dec-13-2024",
      "time":{
        "start": "14:00",
        "end": ""
      },
      "date":{
        "start": "2024-12-15",
        "end": "2024-12-15"
      }
    }
  ]
}