{
  "schema":
  {
    "category": "music|visual-arts|theater|fest|summit",
    "type": "performance|class|workshop|lecture|exhibition|benefit|gathering",
    "slug": "dashed-title--mmm-dd-2022",
    "title": "",
    "performer": "",
    "description": "",
    "details": "",
    "note": "",
    "series": "",
    "price": "$20 at venue / $15 adv online →",
    "price_note": "---Online ticket purchase link to be added soon---",
    "ticket": "",
    "time":{
      "start": "hh:mm",
      "end": ""
    },
    "date":{
      "start": "2022-mm-dd",
      "end": "2022-mm-dd"
    },
    "location": "",
    "image": "",
    "image_width": "800",
    "image_height": "",
    "stream": "",
    "youtube": "",
    "youtube2": "",
    "youtube3": "",
    "flag": {
      "show_registration_form": false,
      "is_outdoors": false,
      "is_postponed": false,
      "is_canceled": false
    },
    "stamp": "",
    "stamp_summary": "",
    "sponsor_text": "",
    "sponsor_image": "",
    "reference_slug": ""
  },
  "events":[
    {
      "category": "music",
      "type": "performance",
      "slug": "tony-mcmanus-legendary-celtic-guitarist--sep-13-2022",
      "title": "Tony McManus - legendary Celtic guitarist",
      "performer": "Tony McManus",
      "description": "Hailed by John Renbourn as ’the best Celtic guitarist in the world’ Tony McManus will grace the JCA Stage Tuesday evening Sept 13th at 8pm",
      "details": "“Tonys music is beyond beautiful… its perfect” ~Tommy Emmanuel\n\n(Tony McManus)[https://tonymcmanus.com] has also been listed as one of the 50 transcendent guitarists of all time by Guitar Player Magazine. Tony has both extended and transcended the parameters of contemporary Celtic music. Ranked by peers and predecessors alike alongside the guitar world’s all-time greats, his fiendishly dexterous, dazzlingly original playing draws on traditions from the entire Celtic world, along with still further-ranging flavours such as jazz and eastern European music. Long applauded for his uncanny ability to transpose the delicate, complex ornamentation characteristic of traditional bagpipe or fiddle tunes – even the phrasing of a Gaelic song – onto his own six strings, McManus is increasingly being acknowledged also as a pioneering figure in bridging the realms of Celtic music and other guitar genres.\n\nBorn in 1965 in Paisley, near Glasgow, McManus was introduced to traditional music via the family record collection. Having first tried his hand at the fiddle, whistle and mandolin, he took up the guitar aged ten, although subsequent academic inclinations got him halfway through a PhD in maths before the music won out. After rapidly making his name as an unusually fluent and sensitive accompanist, he took the solo plunge with a triumphant main-stage debut on the final night of Glasgow’s inaugural Celtic Connections festival in 1994, supporting Capercaillie in front of a 2500-strong crowd.\n\nWith the loyal support of Greentrax Recordings in Scotland Tony’s first self-titled recording in 1996, followed by Pourquoi Quebec in 1999 led to worldwide recognition. However, it was with the release of Ceol More in 2002 that Tony’s stature as a first-class musician reached a new level. Having heard his session work on several albums, Nashville based Compass Records released “Ceol More” in North America to universally ecstatic reviews. Critics hailed the focused, spell-binding nature of the music, from the plaintive Jewish hymn “Shalom Aleichem” to the ingenious arrangement of the Charles Mingus tune “Goodbye Pork Pie Hat”. Having been nominated as Musician of the Year by both the BBC Folk Awards and The Scottish Traditional Music awards, in 2002 “Ceol More” hit the Critic’s Album of the year list in Acoustic Guitar magazine and was named Live Ireland Awards' Album of the Year.\n\nIn a relatively short time Tony’s music has come to define a new role for the guitar in Celtic music. He has come to represent Celtic music in the guitar world, making regular appearances at guitar specific f.festivals such as the Chet Atkins Festival in Nashville; the Ellnora Guitar Festival in one of Illinois's most prestigious venues, the Krannert Center, with the likes of Pat Metheny, Kaki King, Molly Tuttle, and Steve Dawson; has appeared at Guitar Festivals in Soave and Pescantina, Italy; Frankston, Australia; Issoudun, France; Kirkmichael, Scotland; Bath and Kent, England; Bochum and Osnabruck, Germanyand has taught at five of Steve Kaufman’s Acoustic Kamps in Maryville, Tennessee. He performed at the famous Ryman Auditorium in Nashville in the “All Star Guitar Night” featuring Steve Morse, Bryan Sutton, Muriel Anderson, Béla Fleck and Victor Wooten and headlined by the legendary Les Paul. His ability to reach audiences unfamiliar with traditional music is remarkable - he is quite comfortable at predominantly classical events such as the Dundee and Derry Guitar Festivals (appearing six times between the two) and even The Bogotá International Guitar Festival where he followed virtuoso Eduardo Fernandez. He is also a signature artist for PRS Guitars in Maryland, and has performed at their venue with Carlos Santana, among others. These days Tony has a busy tour schedule, but he also authors books on Celtic guitar, and is in demand for workshops and lessons.",
      "note": "",
      "series": "",
      "price": "General Admission $30 at venue, $25 adv online →\nStudents/Seniors $25 at venue, $20 adv online →\nKids 12 and under FREE →",
      "price_note": "",
      "ticket": "408257859247",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-09-13",
        "end": "2022-09-13"
      },
      "location": "",
      "image": "tony-mcmanus.jpg",
      "image_width": "800",
      "image_height": "534",
      "stream": "",
      "youtube": "ID9GWTDFUoI",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "blu-egyptian--aug-25-2022",
      "title": "Blü Egyptian Outdoor Show",
      "performer": "Blü Egyptian",
      "description": "Blü Egyptian …Chico based funk world bluegrass band is coming to Mount Shasta play the JCA field on August 25th!",
      "details": "Grab your dancing shoes and come out to the JCA field on Thursday evening August 25th Tickets $10 advance $15 at the gate. JCA Bar on site bring a chair a blanket. Picnics are welcome. Dancing is vital! Gates open at 6:30. See you there!\n\n[Blü Egyptian](https://www.bluegyptianband.com/) from Chico, Ca, play original music encompassing bluegrass, rock, funk, latin and reggae for the ultimate dance party!\n\nFormed in 2020, Blü Egyptian are friends who met in the recording arts classes in high school and then became a band when the school closed during the pandemic. During that time, they streamed live on Twitch and released a 4-song EP in January 2021. They released their first full length s/t album “Blü Egyptian” in June 2021 and have been touring throughout Northern California since. The new album “Dame Un Segundo” was released in May 2022. They have been touring throughout Northern California this summer playing at many festivals including High Sierra Music Festival, Hogfarm Hideaway, Feather River Flowdown, Owlfest X and California Worldfest.",
      "note": "Gates open at 6:30",
      "series": "",
      "price": "$15 at venue / $10 adv online →",
      "price_note": "",
      "ticket": "399648979857",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-08-25",
        "end": "2022-08-25"
      },
      "location": "",
      "image": "blu-egyptian.jpg",
      "image_width": "720",
      "image_height": "720",
      "stream": "",
      "youtube": "X7xuqJDR95c",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": true
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "alice-in-wonderland--aug-05-2022",
      "title": "Alice In Wonderland",
      "performer": "Mt Shasta Childrens Theatre",
      "description": "Mt Shasta Childrens Theatre presents ALICE IN WONDERLAND, the 9th Annual Broadway Camp Musical Performance.",
      "details": "This brand-new musical version of the timeless classic takes you down the rabbit hole with the ever-curious Alice to a land of zany adventures where nothing is as it seems. The White Rabbit, Tweedle-Dee and Tweedle-Dum, the Mad Hatter, the Caterpillar, the Mock Turtle, the mysterious Cheshire Cat, the Queen of Hearts, and all your favorites from Lewis Carroll’s beloved books make this a magical, tuneful, and over-the-top entertaining musical for the whole family!",
      "note": "",
      "series": "",
      "price": "General Admission $20 at venue, $15 adv online →\nStudents/Seniors $15 at venue, $10 adv online →\nKids 8 and under FREE →",
      "price_note": "",
      "ticket": "382655993377",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-05",
        "end": "2022-08-05"
      },
      "location": "",
      "image": "alice-in-wonderland.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "slug": "alice-in-wonderland-matinee--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-06-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "19:00",
        "end": "21:00"
      },
      "date":{
        "start": "2022-08-06",
        "end": "2022-08-06"
      }
    },
    {
      "slug": "alice-in-wonderland--aug-07-2022",
      "reference_slug": "alice-in-wonderland--aug-05-2022",
      "time":{
        "start": "14:00",
        "end": "16:00"
      },
      "date":{
        "start": "2022-08-07",
        "end": "2022-08-07"
      }
    },
    {
      "category": "music",
      "type": "dance party",
      "slug": "catch-rabbit-sprig--jul-28-2022",
      "title": "Catch Rabbit & Sprig",
      "performer": "Catch Rabbit, Sprig",
      "description": "A FREE outdoors dance party for all ages. Seattle based Catch Rabbit is a psychedelic art-pop project. Sprig opens. An evening of unique and pleasurable musical theatrics.",
      "details": "**CATCH RABBIT**\n\nis the faint aroma of cotton candy in a swirling circus of pleasure. Catch Rabbit is the moment you wake up, when the dream world barges into the real world only to vanish in a puff of glitter. Catch Rabbit is your butt—your personal, literal butt—vibing rhythmically to the symphony of your feelings.\n\nTheir self-titled debut cassette is out now on Den Tapes. Buy the tape to hear Better Angels, Nobody Really Knows and Autumnesque, plus 5 more unheard tracks!\n\n“Would sound real good blasting from a car radio as you do a little Summertime cruise on Alki Beach” - DJ nstop, Hollow Earth Radio\n\n“Recommended for living in a kaleidoscope” - The Tape Deck\n\n\n**SPRIG**\n\nBe The Queercoded Villain You Wanted to Date as a Child.\n\nIt's campy synthy buttrock for girls TM\n\nChristiana is a dumbass ecogoth who writes the songs and does keytar.\n\nDrew Shreve is a powerful drum slut with a growing synth kink.\n\nSara does Viola! She does guitar! She does weird things to my feet!\n\nWatch Out\n\nDrea is our vers goddess of bass, synths, keys, percussion and KINDNESS",
      "note": "",
      "series": "",
      "price": "free admission",
      "price_note": "",
      "ticket": "",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-28",
        "end": "2022-07-28"
      },
      "location": "",
      "image": "catch-rabbit-sprig.jpg",
      "image_width": "700",
      "image_height": "400",
      "stream": "",
      "youtube": "bVDriykl9Ds",
      "youtube2": "9bCjY8VNtAo",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "music",
      "type": "performance",
      "slug": "pato-banton-reggae-show-outdoors--jul-19-2022",
      "title": "Pato Banton reggae show outdoors",
      "performer": "Pato Banton",
      "description": "Reggae Legend Pato Banton Live in Mt Shasta for an Outdoor Show.",
      "details": "[Pato Banton](https://officialpatobanton.com/) is a grammy nominated reggae legend that has recorded and toured the world with The English Beat, Steel Pulse, UB40 & STING! (just to name a few) . During the year 2000, while in the midst of a global trek with Peter Gabriel’s WOMAD organization, that combined huge festivals with music outreach programs to poor and underprivileged communities, Pato learned that two of his sons had been shot in a drive-by shooting! He immediately put his career on hold and turned his sorrow into the impetus for community & educational initiatives that would consume the next six years of his life.\n\nPato created an organization called “Musical Connections” and in partnership the Community Safety Team, provided tuition and counseling for “at risk” young people in 16 different communities across his city of Birmingham, UK. This project was so successful that Pato was approached by the West Midlands Police Department to tackle the ongoing problem of gun crime in some of the poorest neighborhoods. Within a few years this partnership greatly reduced gun crime across the entire city and Pato was given a Lifetime Achievement Award by the BBC and entered into the British Music Hall of Fame during the same year.\n\nIn 2006, after feeling that he had planted enough seeds of progress within his home community, Pato decided to relocate to Southern California and embark on the second phase of his musical journey, taking with him the years of experience in the field of Loving Service. Since then Pato has recorded many albums and collaborated with artists all over the world. His most recent albums Love Is The Greatest & The Words Of Rastafari were released on Bob Marley’s Tuff Gong Records International.\n\nPato Banton’s four-decade public presence has increasingly transcended music to convey a positive & uplifting message of global peace and love for humanity. Now based in Southern California, he continues to record and tour the world extensively with his band The Now Generation, while simultaneously serving as a Teacher, Minister, Counselor and Mentor to his Fans, Friends & Family worldwide!",
      "note": "",
      "series": "",
      "price": "$20 at venue / $15 adv online →\nKids 10 and under FREE →",
      "price_note": "",
      "ticket": "377510362657",
      "time":{
        "start": "19:00",
        "end": ""
      },
      "date":{
        "start": "2022-07-19",
        "end": "2022-07-19"
      },
      "location": "",
      "image": "pato-banton.jpg",
      "image_width": "800",
      "image_height": "533",
      "stream": "",
      "youtube": "2qG5PlhdCMU",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "fest",
      "type": "benefit",
      "slug": "mt-shasta-oktoberfest-oct-01-2022",
      "title": "Mount Shasta Oktoberfest",
      "performer": "",
      "description": "Save the date! More info comming soon.",
      "details": "",
      "note": "",
      "series": "",
      "price": "",
      "price_note": "---Online ticket purchase link to be added September 1st---",
      "ticket": "",
      "time":{
        "start": "12:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-10-01",
        "end": "2022-10-01"
      },
      "location": "",
      "image": "oktober-fest-20221001.jpg",
      "image_width": "600",
      "image_height": "929",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": true,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "summit",
      "type": "gathering",
      "slug": "mt-shasta-star-knowledge-peace-summit--aug-12-15-2022",
      "title": "Mt. Shasta Star Knowledge Peace Summit",
      "performer": "",
      "description": "Three days of Wisdom Keepers, Music & Dance. We/You, are all Sacred Beings. Let’s Unite in Prayer & Peace to help change the Planet.\nEarly bird special until 7/7/22 at 7:00PM.",
      "details": "Do you hear the calling to Mount Shasta? We would love for you to join us.\n\nMount Shasta is a sacred place, a dimensional Doorway to the frequency of Love, let us join together to open our hearts to pure love and Bliss.\n\nShasta is a mirror that shows us the purity of who we truly are are.\n\n\nAll Nations - All Races - All Our Relations\n\n\n**Speakers**\n\nAlway our in Spirit Leader Chief Golden Light Eagle Loren Zephier.\n\nTerri (Sings with Ravens) Rivera\n\nCarla Poluha\n\nFumi Johns Stewart\n\n**Co-Host** Dr. Arthur Robert Cushman (Tata Arturo) (Arturo Luminoso Ketzal Tlanetzia)\n\nJose Federico Munoz\n\nNikki Zephier South Dakota Daughter of Chief Golden Light Eagle\n\nBlue Hail Matthew D Campbell Jr. Head Singer Star Knowledge Drum\n\nHead Dancer Tata Cuco Murillo from Tecate, Baja California (tentative)\n\nLuis Antonio Fernandez Razo\n\nWash Chimalli ( Nahuatl)\n\nMexika Wisdom Keeper From Meshico Tenochtitlan ( Mexico 🇲🇽 City)\n\nDanza Ameyaltzin Yolihuani\n\nAunty Pooki Lee\n\nLeza Vivio\n\nBishop Darrell Nichols\n\nGeri LittleJohn\n\nMartha Elena Sáenz\n\nLauraSa Pele Lafoia Ava\n\nClaudia Tomasiewicz\n\nJen Noel\n\nBill Homann & The Mitchell-Hedges Crystal Skull\n\nFULL DETAILS on [eventbrite ticket website](https://www.eventbrite.com/e/mt-shasta-star-knowledge-peace-summit-immersion-tickets-159043905603)",
      "note": "",
      "series": "",
      "price": "$222 early bird special / $333 after July 7 →",
      "price_note": "Early bird special until 7/7/22 at 7:00PM",
      "ticket": "159043905603",
      "time":{
        "start": "09:00",
        "end": "18:00"
      },
      "date":{
        "start": "2022-08-12",
        "end": "2022-08-15"
      },
      "location": "",
      "image": "star-knowledge-peace-summit.jpg",
      "image_width": "800",
      "image_height": "400",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    },
    {
      "category": "theater",
      "type": "performance",
      "slug": "comedy-night-jun-18-2022",
      "title": "Comedy Night at the JCA",
      "performer": "Shannon Battle, Jen Jay, Nick Meier",
      "description": "JCA Presents COMEDY NIGHT with headliner Shannon Battle. Featuring Jen Jay, Hosted by Nick Meier.",
      "details": "Three hilarious comics coming to Mt Shasta\n\n[Shannon “Funny” Battle](https://www.instagram.com/shannon_battle_funny/)\n\nJen Jay - 2nd place winner of Eugene, Oregons Funniest People 2021\n\nNick Meier - A sexually charged human sized hard-boiled egg of a comedian.",
      "note": "",
      "series": "Comedy Night",
      "price": "$20 at venue / $15 adv online →",
      "price_note": "",
      "ticket": "359777081937",
      "time":{
        "start": "20:00",
        "end": ""
      },
      "date":{
        "start": "2022-06-18",
        "end": "2022-06-18"
      },
      "location": "",
      "image": "comedy-night-20220618.jpg",
      "image_width": "750",
      "image_height": "950",
      "stream": "",
      "youtube": "",
      "youtube2": "",
      "youtube3": "",
      "flag": {
        "show_registration_form": false,
        "is_outdoors": false,
        "is_postponed": false,
        "is_canceled": false
      },
      "stamp": "",
      "stamp_summary": "",
      "sponsor_text": "",
      "sponsor_image": "",
      "reference_slug": ""
    }
  ]
}